Nadir-KT/Programming-Languages/DSA/DFL/11-CSP_CCRL_R5F104PJ_DataFlash_v3/R5F10DPL.001/iodefine.h
/******************************************************************************/
/* DISCLAIMER                                                                 */
/* This software is supplied by Renesas Electronics Corporation and is only   */
/* intended for use with Renesas products. No other uses are authorized.This  */
/* software is owned by Renesas Electronics Corporation and is protected      */
/* under all applicable laws, including copyright laws.                       */
/* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES          */
/* REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING  */
/* BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR */
/* PURPOSE AND NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY           */
/* DISCLAIMED.                                                                */
/* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS     */
/* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE       */
/* LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL      */
/* DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS    */
/* AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.           */
/* Renesas reserves the right, without notice, to make changes to this        */
/* software and to discontinue the availability of this software.             */
/* By using this software, you agree to the additional terms and conditions   */
/* found by accessing the following link:                                     */
/* http://www.renesas.com/disclaimer                                          */
/*                                                                            */
/* Device     : RL78/R5F10DPL                                                 */
/* File Name  : iodefine.h                                                    */
/* Abstract   : Definition of Special Function Register (SFR)                 */
/* History    : V1.10  [Device File version]                                  */
/* Options    : -df=C:\Program Files (x86)\Renesas Electronics\CS+\CC\Device\ */
/*              RL78\Devicefile\DR5F10DPL.DVF -o=D:\MEGAsync\Embedded\Cluster */
/*              \Renesas\RL78\RL78 D1A\11-CSP_CCRL_R5F104PJ_DataFlash_v3\R5F1 */
/*              0DPL.001\iodefine.h -f                                        */
/* Date       : 17-10-2022                                                    */
/* Version    : V1.16.00.02  [df2iodef.exe version]                           */
/* This is a typical example.                                                 */
/*                                                                            */
/******************************************************************************/
#ifndef __R5F10DPLIODEFINE_HEADER__
#define __R5F10DPLIODEFINE_HEADER__

typedef struct
{
    unsigned char no0:1;
    unsigned char no1:1;
    unsigned char no2:1;
    unsigned char no3:1;
    unsigned char no4:1;
    unsigned char no5:1;
    unsigned char no6:1;
    unsigned char no7:1;
} __bitf_T;

typedef struct
{
    unsigned char no0:1;
    unsigned char no1:1;
    unsigned char no2:1;
    unsigned char no3:1;
    unsigned char no4:1;
    unsigned char no5:1;
    unsigned char no6:1;
    unsigned char no7:1;
    unsigned char no8:1;
    unsigned char no9:1;
    unsigned char no10:1;
    unsigned char no11:1;
    unsigned char no12:1;
    unsigned char no13:1;
    unsigned char no14:1;
    unsigned char no15:1;
} __bitf_T2;



#define ADM2         (*(volatile __near unsigned char  *)0x10)
#define ADM2_bit     (*(volatile __near __bitf_T *)0x10)
#define ADTYP        (((volatile __near __bitf_T *)0x10)->no0)
#define AWC          (((volatile __near __bitf_T *)0x10)->no2)
#define ADRCK        (((volatile __near __bitf_T *)0x10)->no3)
#define ADREFM       (((volatile __near __bitf_T *)0x10)->no5)
#define ADREFP0      (((volatile __near __bitf_T *)0x10)->no6)
#define ADREFP1      (((volatile __near __bitf_T *)0x10)->no7)
#define ADUL         (*(volatile __near unsigned char  *)0x11)
#define ADLL         (*(volatile __near unsigned char  *)0x12)
#define ADTES        (*(volatile __near unsigned char  *)0x13)
#define PU0          (*(volatile __near unsigned char  *)0x30)
#define PU0_bit      (*(volatile __near __bitf_T *)0x30)
#define PU1          (*(volatile __near unsigned char  *)0x31)
#define PU1_bit      (*(volatile __near __bitf_T *)0x31)
#define PU3          (*(volatile __near unsigned char  *)0x33)
#define PU3_bit      (*(volatile __near __bitf_T *)0x33)
#define PU4          (*(volatile __near unsigned char  *)0x34)
#define PU4_bit      (*(volatile __near __bitf_T *)0x34)
#define PU5          (*(volatile __near unsigned char  *)0x35)
#define PU5_bit      (*(volatile __near __bitf_T *)0x35)
#define PU6          (*(volatile __near unsigned char  *)0x36)
#define PU6_bit      (*(volatile __near __bitf_T *)0x36)
#define PU7          (*(volatile __near unsigned char  *)0x37)
#define PU7_bit      (*(volatile __near __bitf_T *)0x37)
#define PU8          (*(volatile __near unsigned char  *)0x38)
#define PU8_bit      (*(volatile __near __bitf_T *)0x38)
#define PU9          (*(volatile __near unsigned char  *)0x39)
#define PU9_bit      (*(volatile __near __bitf_T *)0x39)
#define PU13         (*(volatile __near unsigned char  *)0x3D)
#define PU13_bit     (*(volatile __near __bitf_T *)0x3D)
#define PU14         (*(volatile __near unsigned char  *)0x3E)
#define PU14_bit     (*(volatile __near __bitf_T *)0x3E)
#define PIM0         (*(volatile __near unsigned char  *)0x40)
#define PIM0_bit     (*(volatile __near __bitf_T *)0x40)
#define PIM1         (*(volatile __near unsigned char  *)0x41)
#define PIM1_bit     (*(volatile __near __bitf_T *)0x41)
#define PIM3         (*(volatile __near unsigned char  *)0x43)
#define PIM3_bit     (*(volatile __near __bitf_T *)0x43)
#define PIM5         (*(volatile __near unsigned char  *)0x45)
#define PIM5_bit     (*(volatile __near __bitf_T *)0x45)
#define PIM6         (*(volatile __near unsigned char  *)0x46)
#define PIM6_bit     (*(volatile __near __bitf_T *)0x46)
#define PIM7         (*(volatile __near unsigned char  *)0x47)
#define PIM7_bit     (*(volatile __near __bitf_T *)0x47)
#define PIM13        (*(volatile __near unsigned char  *)0x4D)
#define PIM13_bit    (*(volatile __near __bitf_T *)0x4D)
#define LCDPF0       (*(volatile __near unsigned char  *)0x50)
#define LCDPF0_bit   (*(volatile __near __bitf_T *)0x50)
#define LCDPF1       (*(volatile __near unsigned char  *)0x51)
#define LCDPF1_bit   (*(volatile __near __bitf_T *)0x51)
#define LCDPF3       (*(volatile __near unsigned char  *)0x53)
#define LCDPF3_bit   (*(volatile __near __bitf_T *)0x53)
#define LCDPF5       (*(volatile __near unsigned char  *)0x55)
#define LCDPF5_bit   (*(volatile __near __bitf_T *)0x55)
#define LCDPF7       (*(volatile __near unsigned char  *)0x57)
#define LCDPF7_bit   (*(volatile __near __bitf_T *)0x57)
#define LCDPF8       (*(volatile __near unsigned char  *)0x58)
#define LCDPF8_bit   (*(volatile __near __bitf_T *)0x58)
#define LCDPF9       (*(volatile __near unsigned char  *)0x59)
#define LCDPF9_bit   (*(volatile __near __bitf_T *)0x59)
#define LCDPF13      (*(volatile __near unsigned char  *)0x5D)
#define LCDPF13_bit  (*(volatile __near __bitf_T *)0x5D)
#define TNFEN0       (*(volatile __near unsigned char  *)0x60)
#define TNFEN0_bit   (*(volatile __near __bitf_T *)0x60)
#define TNFSMP0      (*(volatile __near unsigned char  *)0x61)
#define TNFSMP0_bit  (*(volatile __near __bitf_T *)0x61)
#define TNFSMP000    (((volatile __near __bitf_T *)0x61)->no0)
#define TNFSMP001    (((volatile __near __bitf_T *)0x61)->no1)
#define TNFSMP002    (((volatile __near __bitf_T *)0x61)->no2)
#define TNFSMP003    (((volatile __near __bitf_T *)0x61)->no3)
#define TNFSMP010    (((volatile __near __bitf_T *)0x61)->no4)
#define TNFSMP011    (((volatile __near __bitf_T *)0x61)->no5)
#define TNFSMP012    (((volatile __near __bitf_T *)0x61)->no6)
#define TNFSMP013    (((volatile __near __bitf_T *)0x61)->no7)
#define TNFCS0       (*(volatile __near unsigned char  *)0x62)
#define TNFCS0_bit   (*(volatile __near __bitf_T *)0x62)
#define TNFEN1       (*(volatile __near unsigned char  *)0x64)
#define TNFEN1_bit   (*(volatile __near __bitf_T *)0x64)
#define TNFSMP1      (*(volatile __near unsigned char  *)0x65)
#define TNFSMP1_bit  (*(volatile __near __bitf_T *)0x65)
#define TNFSMP100    (((volatile __near __bitf_T *)0x65)->no0)
#define TNFSMP101    (((volatile __near __bitf_T *)0x65)->no1)
#define TNFSMP102    (((volatile __near __bitf_T *)0x65)->no2)
#define TNFSMP103    (((volatile __near __bitf_T *)0x65)->no3)
#define TNFSMP110    (((volatile __near __bitf_T *)0x65)->no4)
#define TNFSMP111    (((volatile __near __bitf_T *)0x65)->no5)
#define TNFSMP112    (((volatile __near __bitf_T *)0x65)->no6)
#define TNFSMP113    (((volatile __near __bitf_T *)0x65)->no7)
#define TNFCS1       (*(volatile __near unsigned char  *)0x66)
#define TNFCS1_bit   (*(volatile __near __bitf_T *)0x66)
#define TNFEN2       (*(volatile __near unsigned char  *)0x68)
#define TNFEN2_bit   (*(volatile __near __bitf_T *)0x68)
#define TNFSMP2      (*(volatile __near unsigned char  *)0x69)
#define TNFSMP2_bit  (*(volatile __near __bitf_T *)0x69)
#define TNFSMP200    (((volatile __near __bitf_T *)0x69)->no0)
#define TNFSMP201    (((volatile __near __bitf_T *)0x69)->no1)
#define TNFSMP202    (((volatile __near __bitf_T *)0x69)->no2)
#define TNFSMP203    (((volatile __near __bitf_T *)0x69)->no3)
#define TNFSMP210    (((volatile __near __bitf_T *)0x69)->no4)
#define TNFSMP211    (((volatile __near __bitf_T *)0x69)->no5)
#define TNFSMP212    (((volatile __near __bitf_T *)0x69)->no6)
#define TNFSMP213    (((volatile __near __bitf_T *)0x69)->no7)
#define TNFCS2       (*(volatile __near unsigned char  *)0x6A)
#define TNFCS2_bit   (*(volatile __near __bitf_T *)0x6A)
#define SNFEN0       (*(volatile __near unsigned char  *)0x6D)
#define SNFEN0_bit   (*(volatile __near __bitf_T *)0x6D)
#define ADPC         (*(volatile __near unsigned char  *)0x6E)
#define POM          (*(volatile __near unsigned char  *)0x6F)
#define POM_bit      (*(volatile __near __bitf_T *)0x6F)
#define TIS00        (*(volatile __near unsigned char  *)0x70)
#define TIS00_bit    (*(volatile __near __bitf_T *)0x70)
#define TIS000       (((volatile __near __bitf_T *)0x70)->no0)
#define TIS010       (((volatile __near __bitf_T *)0x70)->no2)
#define TIS011       (((volatile __near __bitf_T *)0x70)->no3)
#define TIS020       (((volatile __near __bitf_T *)0x70)->no4)
#define TIS030       (((volatile __near __bitf_T *)0x70)->no6)
#define TIS031       (((volatile __near __bitf_T *)0x70)->no7)
#define TIS01        (*(volatile __near unsigned char  *)0x71)
#define TIS01_bit    (*(volatile __near __bitf_T *)0x71)
#define TIS040       (((volatile __near __bitf_T *)0x71)->no0)
#define TIS050       (((volatile __near __bitf_T *)0x71)->no2)
#define TIS051       (((volatile __near __bitf_T *)0x71)->no3)
#define TIS060       (((volatile __near __bitf_T *)0x71)->no4)
#define TIS070       (((volatile __near __bitf_T *)0x71)->no6)
#define TIS071       (((volatile __near __bitf_T *)0x71)->no7)
#define TIS10        (*(volatile __near unsigned char  *)0x72)
#define TIS10_bit    (*(volatile __near __bitf_T *)0x72)
#define TIS110       (((volatile __near __bitf_T *)0x72)->no2)
#define TIS111       (((volatile __near __bitf_T *)0x72)->no3)
#define TIS120       (((volatile __near __bitf_T *)0x72)->no4)
#define TIS130       (((volatile __near __bitf_T *)0x72)->no6)
#define TIS131       (((volatile __near __bitf_T *)0x72)->no7)
#define TIS11        (*(volatile __near unsigned char  *)0x73)
#define TIS11_bit    (*(volatile __near __bitf_T *)0x73)
#define TIS140       (((volatile __near __bitf_T *)0x73)->no0)
#define TIS141       (((volatile __near __bitf_T *)0x73)->no1)
#define TIS150       (((volatile __near __bitf_T *)0x73)->no2)
#define TIS151       (((volatile __near __bitf_T *)0x73)->no3)
#define TIS160       (((volatile __near __bitf_T *)0x73)->no4)
#define TIS161       (((volatile __near __bitf_T *)0x73)->no5)
#define TIS170       (((volatile __near __bitf_T *)0x73)->no6)
#define TIS171       (((volatile __near __bitf_T *)0x73)->no7)
#define TIS20        (*(volatile __near unsigned char  *)0x74)
#define TIS20_bit    (*(volatile __near __bitf_T *)0x74)
#define TIS200       (((volatile __near __bitf_T *)0x74)->no0)
#define TIS201       (((volatile __near __bitf_T *)0x74)->no1)
#define TIS210       (((volatile __near __bitf_T *)0x74)->no2)
#define TIS211       (((volatile __near __bitf_T *)0x74)->no3)
#define TIS220       (((volatile __near __bitf_T *)0x74)->no4)
#define TIS221       (((volatile __near __bitf_T *)0x74)->no5)
#define TIS230       (((volatile __near __bitf_T *)0x74)->no6)
#define TIS231       (((volatile __near __bitf_T *)0x74)->no7)
#define TIS21        (*(volatile __near unsigned char  *)0x75)
#define TIS21_bit    (*(volatile __near __bitf_T *)0x75)
#define TIS240       (((volatile __near __bitf_T *)0x75)->no0)
#define TIS241       (((volatile __near __bitf_T *)0x75)->no1)
#define TIS250       (((volatile __near __bitf_T *)0x75)->no2)
#define TIS251       (((volatile __near __bitf_T *)0x75)->no3)
#define TIS260       (((volatile __near __bitf_T *)0x75)->no4)
#define TIS261       (((volatile __near __bitf_T *)0x75)->no5)
#define TIS270       (((volatile __near __bitf_T *)0x75)->no6)
#define TIS271       (((volatile __near __bitf_T *)0x75)->no7)
#define TOS00        (*(volatile __near unsigned char  *)0x76)
#define TOS00_bit    (*(volatile __near __bitf_T *)0x76)
#define TOS000       (((volatile __near __bitf_T *)0x76)->no0)
#define TOS010       (((volatile __near __bitf_T *)0x76)->no2)
#define TOS011       (((volatile __near __bitf_T *)0x76)->no3)
#define TOS020       (((volatile __near __bitf_T *)0x76)->no4)
#define TOS030       (((volatile __near __bitf_T *)0x76)->no6)
#define TOS031       (((volatile __near __bitf_T *)0x76)->no7)
#define TOS01        (*(volatile __near unsigned char  *)0x77)
#define TOS01_bit    (*(volatile __near __bitf_T *)0x77)
#define TOS040       (((volatile __near __bitf_T *)0x77)->no0)
#define TOS050       (((volatile __near __bitf_T *)0x77)->no2)
#define TOS051       (((volatile __near __bitf_T *)0x77)->no3)
#define TOS060       (((volatile __near __bitf_T *)0x77)->no4)
#define TOS070       (((volatile __near __bitf_T *)0x77)->no6)
#define TOS071       (((volatile __near __bitf_T *)0x77)->no7)
#define IAWCTL       (*(volatile __near unsigned char  *)0x78)
#define TOS10        (*(volatile __near unsigned char  *)0x79)
#define TOS10_bit    (*(volatile __near __bitf_T *)0x79)
#define TOS110       (((volatile __near __bitf_T *)0x79)->no2)
#define TOS111       (((volatile __near __bitf_T *)0x79)->no3)
#define TOS120       (((volatile __near __bitf_T *)0x79)->no4)
#define TOS130       (((volatile __near __bitf_T *)0x79)->no6)
#define TOS131       (((volatile __near __bitf_T *)0x79)->no7)
#define TOS11        (*(volatile __near unsigned char  *)0x7A)
#define TOS11_bit    (*(volatile __near __bitf_T *)0x7A)
#define TOS140       (((volatile __near __bitf_T *)0x7A)->no0)
#define TOS141       (((volatile __near __bitf_T *)0x7A)->no1)
#define TOS150       (((volatile __near __bitf_T *)0x7A)->no2)
#define TOS151       (((volatile __near __bitf_T *)0x7A)->no3)
#define TOS160       (((volatile __near __bitf_T *)0x7A)->no4)
#define TOS161       (((volatile __near __bitf_T *)0x7A)->no5)
#define TOS170       (((volatile __near __bitf_T *)0x7A)->no6)
#define TOS171       (((volatile __near __bitf_T *)0x7A)->no7)
#define TOS20        (*(volatile __near unsigned char  *)0x7B)
#define TOS20_bit    (*(volatile __near __bitf_T *)0x7B)
#define TOS200       (((volatile __near __bitf_T *)0x7B)->no0)
#define TOS201       (((volatile __near __bitf_T *)0x7B)->no1)
#define TOS210       (((volatile __near __bitf_T *)0x7B)->no2)
#define TOS211       (((volatile __near __bitf_T *)0x7B)->no3)
#define TOS220       (((volatile __near __bitf_T *)0x7B)->no4)
#define TOS221       (((volatile __near __bitf_T *)0x7B)->no5)
#define TOS230       (((volatile __near __bitf_T *)0x7B)->no6)
#define TOS231       (((volatile __near __bitf_T *)0x7B)->no7)
#define TOS21        (*(volatile __near unsigned char  *)0x7C)
#define TOS21_bit    (*(volatile __near __bitf_T *)0x7C)
#define TOS240       (((volatile __near __bitf_T *)0x7C)->no0)
#define TOS241       (((volatile __near __bitf_T *)0x7C)->no1)
#define TOS250       (((volatile __near __bitf_T *)0x7C)->no2)
#define TOS251       (((volatile __near __bitf_T *)0x7C)->no3)
#define TOS260       (((volatile __near __bitf_T *)0x7C)->no4)
#define TOS261       (((volatile __near __bitf_T *)0x7C)->no5)
#define TOS270       (((volatile __near __bitf_T *)0x7C)->no6)
#define TOS271       (((volatile __near __bitf_T *)0x7C)->no7)
#define DFLCTL       (*(volatile __near unsigned char  *)0x90)
#define DFLCTL_bit   (*(volatile __near __bitf_T *)0x90)
#define DFLEN        (((volatile __near __bitf_T *)0x90)->no0)
#define HIOTRM       (*(volatile __near unsigned char  *)0xA0)
#define MDCL         (*(volatile __near unsigned short *)0xE0)
#define MDCH         (*(volatile __near unsigned short *)0xE2)
#define MDUC         (*(volatile __near unsigned char  *)0xE8)
#define MDUC_bit     (*(volatile __near __bitf_T *)0xE8)
#define DIVST        (((volatile __near __bitf_T *)0xE8)->no0)
#define MACSF        (((volatile __near __bitf_T *)0xE8)->no1)
#define MACOF        (((volatile __near __bitf_T *)0xE8)->no2)
#define MDSM         (((volatile __near __bitf_T *)0xE8)->no3)
#define MACMODE      (((volatile __near __bitf_T *)0xE8)->no6)
#define DIVMODE      (((volatile __near __bitf_T *)0xE8)->no7)
#define PER0         (*(volatile __near unsigned char  *)0xF0)
#define PER0_bit     (*(volatile __near __bitf_T *)0xF0)
#define TAU0EN       (((volatile __near __bitf_T *)0xF0)->no0)
#define TAU1EN       (((volatile __near __bitf_T *)0xF0)->no1)
#define TAU2EN       (((volatile __near __bitf_T *)0xF0)->no2)
#define SAU0EN       (((volatile __near __bitf_T *)0xF0)->no3)
#define SAU1EN       (((volatile __near __bitf_T *)0xF0)->no4)
#define LIN0EN       (((volatile __near __bitf_T *)0xF0)->no5)
#define LIN1EN       (((volatile __near __bitf_T *)0xF0)->no6)
#define RTCEN        (((volatile __near __bitf_T *)0xF0)->no7)
#define PER1         (*(volatile __near unsigned char  *)0xF1)
#define PER1_bit     (*(volatile __near __bitf_T *)0xF1)
#define SGEN         (((volatile __near __bitf_T *)0xF1)->no4)
#define MTRCEN       (((volatile __near __bitf_T *)0xF1)->no5)
#define ADCEN        (((volatile __near __bitf_T *)0xF1)->no7)
#define PCKSEL       (*(volatile __near unsigned char  *)0xF2)
#define PCKSEL_bit   (*(volatile __near __bitf_T *)0xF2)
#define SGCLKSEL     (((volatile __near __bitf_T *)0xF2)->no0)
#define CANMCK0      (((volatile __near __bitf_T *)0xF2)->no3)
#define CANMCKE0     (((volatile __near __bitf_T *)0xF2)->no4)
#define CANMCK1      (((volatile __near __bitf_T *)0xF2)->no5)
#define CANMCKE1     (((volatile __near __bitf_T *)0xF2)->no6)
#define OSMC         (*(volatile __near unsigned char  *)0xF3)
#define RPECTL       (*(volatile __near unsigned char  *)0xF5)
#define RPECTL_bit   (*(volatile __near __bitf_T *)0xF5)
#define RPEF         (((volatile __near __bitf_T *)0xF5)->no0)
#define RPERDIS      (((volatile __near __bitf_T *)0xF5)->no7)
#define MDIV         (*(volatile __near unsigned char  *)0xF8)
#define RTCCL        (*(volatile __near unsigned char  *)0xF9)
#define RTCCL_bit    (*(volatile __near __bitf_T *)0xF9)
#define RTCCKS0      (((volatile __near __bitf_T *)0xF9)->no0)
#define RTCCKS1      (((volatile __near __bitf_T *)0xF9)->no1)
#define RESFCLM      (*(volatile __near unsigned char  *)0xFA)
#define POCRES       (*(volatile __near unsigned char  *)0xFB)
#define POCRES_bit   (*(volatile __near __bitf_T *)0xFB)
#define GUARD        (*(volatile __near unsigned char  *)0xFC)
#define GUARD_bit    (*(volatile __near __bitf_T *)0xFC)
#define GDPLL        (((volatile __near __bitf_T *)0xFC)->no0)
#define GDRTC        (((volatile __near __bitf_T *)0xFC)->no1)
#define BCDADJ       (*(volatile __near unsigned char  *)0xFE)
#define SSR00        (*(volatile __near unsigned short *)0x100)
#define SSR00L       (*(volatile __near unsigned char  *)0x100)
#define SSR01        (*(volatile __near unsigned short *)0x102)
#define SSR01L       (*(volatile __near unsigned char  *)0x102)
#define SIR00        (*(volatile __near unsigned short *)0x104)
#define SIR00L       (*(volatile __near unsigned char  *)0x104)
#define SIR01        (*(volatile __near unsigned short *)0x106)
#define SIR01L       (*(volatile __near unsigned char  *)0x106)
#define SMR00        (*(volatile __near unsigned short *)0x108)
#define SMR01        (*(volatile __near unsigned short *)0x10A)
#define SCR00        (*(volatile __near unsigned short *)0x10C)
#define SCR01        (*(volatile __near unsigned short *)0x10E)
#define SE0          (*(volatile __near unsigned short *)0x110)
#define SE0L         (*(volatile __near unsigned char  *)0x110)
#define SE0L_bit     (*(volatile __near __bitf_T *)0x110)
#define SS0          (*(volatile __near unsigned short *)0x112)
#define SS0L         (*(volatile __near unsigned char  *)0x112)
#define SS0L_bit     (*(volatile __near __bitf_T *)0x112)
#define ST0          (*(volatile __near unsigned short *)0x114)
#define ST0L         (*(volatile __near unsigned char  *)0x114)
#define ST0L_bit     (*(volatile __near __bitf_T *)0x114)
#define SPS0         (*(volatile __near unsigned short *)0x116)
#define SPS0L        (*(volatile __near unsigned char  *)0x116)
#define SO0          (*(volatile __near unsigned short *)0x118)
#define SOE0         (*(volatile __near unsigned short *)0x11A)
#define SOE0L        (*(volatile __near unsigned char  *)0x11A)
#define SOE0L_bit    (*(volatile __near __bitf_T *)0x11A)
#define SOL0         (*(volatile __near unsigned short *)0x120)
#define SOL0L        (*(volatile __near unsigned char  *)0x120)
#define PLLSTS       (*(volatile __near unsigned char  *)0x128)
#define PLLSTS_bit   (*(volatile __near __bitf_T *)0x128)
#define SELPLLS      (((volatile __near __bitf_T *)0x128)->no3)
#define LOCK         (((volatile __near __bitf_T *)0x128)->no7)
#define PLLCTL       (*(volatile __near unsigned char  *)0x129)
#define PLLCTL_bit   (*(volatile __near __bitf_T *)0x129)
#define PLLON        (((volatile __near __bitf_T *)0x129)->no0)
#define SELPLL       (((volatile __near __bitf_T *)0x129)->no2)
#define PLLDIV0      (((volatile __near __bitf_T *)0x129)->no4)
#define LCKSEL0      (((volatile __near __bitf_T *)0x129)->no6)
#define LCKSEL1      (((volatile __near __bitf_T *)0x129)->no7)
#define SSR10        (*(volatile __near unsigned short *)0x130)
#define SSR10L       (*(volatile __near unsigned char  *)0x130)
#define SSR11        (*(volatile __near unsigned short *)0x132)
#define SSR11L       (*(volatile __near unsigned char  *)0x132)
#define SIR10        (*(volatile __near unsigned short *)0x134)
#define SIR10L       (*(volatile __near unsigned char  *)0x134)
#define SIR11        (*(volatile __near unsigned short *)0x136)
#define SIR11L       (*(volatile __near unsigned char  *)0x136)
#define SMR10        (*(volatile __near unsigned short *)0x138)
#define SMR11        (*(volatile __near unsigned short *)0x13A)
#define SCR10        (*(volatile __near unsigned short *)0x13C)
#define SCR11        (*(volatile __near unsigned short *)0x13E)
#define SE1          (*(volatile __near unsigned short *)0x140)
#define SE1L         (*(volatile __near unsigned char  *)0x140)
#define SE1L_bit     (*(volatile __near __bitf_T *)0x140)
#define SS1          (*(volatile __near unsigned short *)0x142)
#define SS1L         (*(volatile __near unsigned char  *)0x142)
#define SS1L_bit     (*(volatile __near __bitf_T *)0x142)
