Nadir-KT/Programming-Languages/DSA/DFL/11-CSP_CCRL_R5F104PJ_DataFlash_v3/R5F10DPL.001/iodefine.h
#define ST1          (*(volatile __near unsigned short *)0x144)
#define ST1L         (*(volatile __near unsigned char  *)0x144)
#define ST1L_bit     (*(volatile __near __bitf_T *)0x144)
#define SPS1         (*(volatile __near unsigned short *)0x146)
#define SPS1L        (*(volatile __near unsigned char  *)0x146)
#define SO1          (*(volatile __near unsigned short *)0x148)
#define SO1L         (*(volatile __near unsigned char  *)0x148)
#define SOE1         (*(volatile __near unsigned short *)0x14A)
#define SOE1L        (*(volatile __near unsigned char  *)0x14A)
#define SOE1L_bit    (*(volatile __near __bitf_T *)0x14A)
#define SOL1         (*(volatile __near unsigned short *)0x150)
#define SOL1L        (*(volatile __near unsigned char  *)0x150)
#define MCMPC4       (*(volatile __near unsigned char  *)0x158)
#define MCMPC4_bit   (*(volatile __near __bitf_T *)0x158)
#define DIR40        (((volatile __near __bitf_T *)0x158)->no0)
#define DIR41        (((volatile __near __bitf_T *)0x158)->no1)
#define ADB40        (((volatile __near __bitf_T *)0x158)->no2)
#define ADB41        (((volatile __near __bitf_T *)0x158)->no3)
#define TEN4         (((volatile __near __bitf_T *)0x158)->no4)
#define ZPD4         (((volatile __near __bitf_T *)0x158)->no5)
#define TWIN4        (((volatile __near __bitf_T *)0x158)->no6)
#define AOUT4        (((volatile __near __bitf_T *)0x158)->no7)
#define ZPDS0        (*(volatile __near unsigned char  *)0x15C)
#define ZPDS0_bit    (*(volatile __near __bitf_T *)0x15C)
#define ZPD1S0       (((volatile __near __bitf_T *)0x15C)->no0)
#define ZPD1S1       (((volatile __near __bitf_T *)0x15C)->no1)
#define ZPD1S2       (((volatile __near __bitf_T *)0x15C)->no2)
#define ZPD1PC       (((volatile __near __bitf_T *)0x15C)->no3)
#define ZPD2S0       (((volatile __near __bitf_T *)0x15C)->no4)
#define ZPD2S1       (((volatile __near __bitf_T *)0x15C)->no5)
#define ZPD2S2       (((volatile __near __bitf_T *)0x15C)->no6)
#define ZPD2PC       (((volatile __near __bitf_T *)0x15C)->no7)
#define ZPDS1        (*(volatile __near unsigned char  *)0x15D)
#define ZPDS1_bit    (*(volatile __near __bitf_T *)0x15D)
#define ZPD3S0       (((volatile __near __bitf_T *)0x15D)->no0)
#define ZPD3S1       (((volatile __near __bitf_T *)0x15D)->no1)
#define ZPD3S2       (((volatile __near __bitf_T *)0x15D)->no2)
#define ZPD3PC       (((volatile __near __bitf_T *)0x15D)->no3)
#define ZPD4S0       (((volatile __near __bitf_T *)0x15D)->no4)
#define ZPD4S1       (((volatile __near __bitf_T *)0x15D)->no5)
#define ZPD4S2       (((volatile __near __bitf_T *)0x15D)->no6)
#define ZPD4PC       (((volatile __near __bitf_T *)0x15D)->no7)
#define CMPCTL       (*(volatile __near unsigned char  *)0x15E)
#define CMPCTL_bit   (*(volatile __near __bitf_T *)0x15E)
#define DBCL0        (((volatile __near __bitf_T *)0x15E)->no0)
#define DBCL1        (((volatile __near __bitf_T *)0x15E)->no1)
#define DBCL2        (((volatile __near __bitf_T *)0x15E)->no2)
#define DBCL3        (((volatile __near __bitf_T *)0x15E)->no3)
#define ZPDEN        (*(volatile __near unsigned char  *)0x15F)
#define ZPDEN_bit    (*(volatile __near __bitf_T *)0x15F)
#define ZPD1EN       (((volatile __near __bitf_T *)0x15F)->no0)
#define ZPD2EN       (((volatile __near __bitf_T *)0x15F)->no1)
#define ZPD3EN       (((volatile __near __bitf_T *)0x15F)->no2)
#define ZPD4EN       (((volatile __near __bitf_T *)0x15F)->no3)
#define MCNTC0       (*(volatile __near unsigned char  *)0x160)
#define MCNTC0_bit   (*(volatile __near __bitf_T *)0x160)
#define SMCL0        (((volatile __near __bitf_T *)0x160)->no0)
#define SMCL1        (((volatile __near __bitf_T *)0x160)->no1)
#define SMCL2        (((volatile __near __bitf_T *)0x160)->no2)
#define PCS          (((volatile __near __bitf_T *)0x160)->no3)
#define PCE          (((volatile __near __bitf_T *)0x160)->no4)
#define FULL         (((volatile __near __bitf_T *)0x160)->no5)
#define CAE          (((volatile __near __bitf_T *)0x160)->no7)
#define MCMP1HW      (*(volatile __near unsigned short *)0x162)
#define MCMP10       (*(volatile __near unsigned char  *)0x162)
#define MCMP11       (*(volatile __near unsigned char  *)0x163)
#define MCMP2HW      (*(volatile __near unsigned short *)0x164)
#define MCMP20       (*(volatile __near unsigned char  *)0x164)
#define MCMP21       (*(volatile __near unsigned char  *)0x165)
#define MCMP3HW      (*(volatile __near unsigned short *)0x166)
#define MCMP30       (*(volatile __near unsigned char  *)0x166)
#define MCMP31       (*(volatile __near unsigned char  *)0x167)
#define MCMP4HW      (*(volatile __near unsigned short *)0x168)
#define MCMP40       (*(volatile __near unsigned char  *)0x168)
#define MCMP41       (*(volatile __near unsigned char  *)0x169)
#define MCMPC1       (*(volatile __near unsigned char  *)0x16A)
#define MCMPC1_bit   (*(volatile __near __bitf_T *)0x16A)
#define DIR10        (((volatile __near __bitf_T *)0x16A)->no0)
#define DIR11        (((volatile __near __bitf_T *)0x16A)->no1)
#define ADB10        (((volatile __near __bitf_T *)0x16A)->no2)
#define ADB11        (((volatile __near __bitf_T *)0x16A)->no3)
#define TEN1         (((volatile __near __bitf_T *)0x16A)->no4)
#define ZPD1         (((volatile __near __bitf_T *)0x16A)->no5)
#define TWIN1        (((volatile __near __bitf_T *)0x16A)->no6)
#define AOUT1        (((volatile __near __bitf_T *)0x16A)->no7)
#define MCMPC2       (*(volatile __near unsigned char  *)0x16C)
#define MCMPC2_bit   (*(volatile __near __bitf_T *)0x16C)
#define DIR20        (((volatile __near __bitf_T *)0x16C)->no0)
#define DIR21        (((volatile __near __bitf_T *)0x16C)->no1)
#define ADB20        (((volatile __near __bitf_T *)0x16C)->no2)
#define ADB21        (((volatile __near __bitf_T *)0x16C)->no3)
#define TEN2         (((volatile __near __bitf_T *)0x16C)->no4)
#define ZPD2         (((volatile __near __bitf_T *)0x16C)->no5)
#define TWIN2        (((volatile __near __bitf_T *)0x16C)->no6)
#define AOUT2        (((volatile __near __bitf_T *)0x16C)->no7)
#define MCMPC3       (*(volatile __near unsigned char  *)0x16E)
#define MCMPC3_bit   (*(volatile __near __bitf_T *)0x16E)
#define DIR30        (((volatile __near __bitf_T *)0x16E)->no0)
#define DIR31        (((volatile __near __bitf_T *)0x16E)->no1)
#define ADB30        (((volatile __near __bitf_T *)0x16E)->no2)
#define ADB31        (((volatile __near __bitf_T *)0x16E)->no3)
#define TEN3         (((volatile __near __bitf_T *)0x16E)->no4)
#define ZPD3         (((volatile __near __bitf_T *)0x16E)->no5)
#define TWIN3        (((volatile __near __bitf_T *)0x16E)->no6)
#define AOUT3        (((volatile __near __bitf_T *)0x16E)->no7)
#define DSA2         (*(volatile __near unsigned char  *)0x170)
#define DSA3         (*(volatile __near unsigned char  *)0x171)
#define DRA2         (*(volatile __near unsigned short *)0x172)
#define DRA2L        (*(volatile __near unsigned char  *)0x172)
#define DRA2H        (*(volatile __near unsigned char  *)0x173)
#define DRA3         (*(volatile __near unsigned short *)0x174)
#define DRA3L        (*(volatile __near unsigned char  *)0x174)
#define DRA3H        (*(volatile __near unsigned char  *)0x175)
#define DBC2         (*(volatile __near unsigned short *)0x176)
#define DBC2L        (*(volatile __near unsigned char  *)0x176)
#define DBC2H        (*(volatile __near unsigned char  *)0x177)
#define DBC3         (*(volatile __near unsigned short *)0x178)
#define DBC3L        (*(volatile __near unsigned char  *)0x178)
#define DBC3H        (*(volatile __near unsigned char  *)0x179)
#define DMC2         (*(volatile __near unsigned char  *)0x17A)
#define DMC2_bit     (*(volatile __near __bitf_T *)0x17A)
#define IFC20        (((volatile __near __bitf_T *)0x17A)->no0)
#define IFC21        (((volatile __near __bitf_T *)0x17A)->no1)
#define IFC22        (((volatile __near __bitf_T *)0x17A)->no2)
#define IFC23        (((volatile __near __bitf_T *)0x17A)->no3)
#define DWAIT2       (((volatile __near __bitf_T *)0x17A)->no4)
#define DS2          (((volatile __near __bitf_T *)0x17A)->no5)
#define DRS2         (((volatile __near __bitf_T *)0x17A)->no6)
#define STG2         (((volatile __near __bitf_T *)0x17A)->no7)
#define DMC3         (*(volatile __near unsigned char  *)0x17B)
#define DMC3_bit     (*(volatile __near __bitf_T *)0x17B)
#define IFC30        (((volatile __near __bitf_T *)0x17B)->no0)
#define IFC31        (((volatile __near __bitf_T *)0x17B)->no1)
#define IFC32        (((volatile __near __bitf_T *)0x17B)->no2)
#define IFC33        (((volatile __near __bitf_T *)0x17B)->no3)
#define DWAIT3       (((volatile __near __bitf_T *)0x17B)->no4)
#define DS3          (((volatile __near __bitf_T *)0x17B)->no5)
#define DRS3         (((volatile __near __bitf_T *)0x17B)->no6)
#define STG3         (((volatile __near __bitf_T *)0x17B)->no7)
#define DRC2         (*(volatile __near unsigned char  *)0x17C)
#define DRC2_bit     (*(volatile __near __bitf_T *)0x17C)
#define DST2         (((volatile __near __bitf_T *)0x17C)->no0)
#define DEN2         (((volatile __near __bitf_T *)0x17C)->no7)
#define DRC3         (*(volatile __near unsigned char  *)0x17D)
#define DRC3_bit     (*(volatile __near __bitf_T *)0x17D)
#define DST3         (((volatile __near __bitf_T *)0x17D)->no0)
#define DEN3         (((volatile __near __bitf_T *)0x17D)->no7)
#define DWAITALL     (*(volatile __near unsigned char  *)0x17F)
#define DWAITALL_bit (*(volatile __near __bitf_T *)0x17F)
#define DWAITALL0    (((volatile __near __bitf_T *)0x17F)->no0)
#define PRVARI       (((volatile __near __bitf_T *)0x17F)->no7)
#define TCR00        (*(volatile __near unsigned short *)0x180)
#define TCR01        (*(volatile __near unsigned short *)0x182)
#define TCR02        (*(volatile __near unsigned short *)0x184)
#define TCR03        (*(volatile __near unsigned short *)0x186)
#define TCR04        (*(volatile __near unsigned short *)0x188)
#define TCR05        (*(volatile __near unsigned short *)0x18A)
#define TCR06        (*(volatile __near unsigned short *)0x18C)
#define TCR07        (*(volatile __near unsigned short *)0x18E)
#define TMR00        (*(volatile __near unsigned short *)0x190)
#define TMR01        (*(volatile __near unsigned short *)0x192)
#define TMR02        (*(volatile __near unsigned short *)0x194)
#define TMR03        (*(volatile __near unsigned short *)0x196)
#define TMR04        (*(volatile __near unsigned short *)0x198)
#define TMR05        (*(volatile __near unsigned short *)0x19A)
#define TMR06        (*(volatile __near unsigned short *)0x19C)
#define TMR07        (*(volatile __near unsigned short *)0x19E)
#define TSR00        (*(volatile __near unsigned short *)0x1A0)
#define TSR00L       (*(volatile __near unsigned char  *)0x1A0)
#define TSR01        (*(volatile __near unsigned short *)0x1A2)
#define TSR01L       (*(volatile __near unsigned char  *)0x1A2)
#define TSR02        (*(volatile __near unsigned short *)0x1A4)
#define TSR02L       (*(volatile __near unsigned char  *)0x1A4)
#define TSR03        (*(volatile __near unsigned short *)0x1A6)
#define TSR03L       (*(volatile __near unsigned char  *)0x1A6)
#define TSR04        (*(volatile __near unsigned short *)0x1A8)
#define TSR04L       (*(volatile __near unsigned char  *)0x1A8)
#define TSR05        (*(volatile __near unsigned short *)0x1AA)
#define TSR05L       (*(volatile __near unsigned char  *)0x1AA)
#define TSR06        (*(volatile __near unsigned short *)0x1AC)
#define TSR06L       (*(volatile __near unsigned char  *)0x1AC)
#define TSR07        (*(volatile __near unsigned short *)0x1AE)
#define TSR07L       (*(volatile __near unsigned char  *)0x1AE)
#define TE0          (*(volatile __near unsigned short *)0x1B0)
#define TE0L         (*(volatile __near unsigned char  *)0x1B0)
#define TE0L_bit     (*(volatile __near __bitf_T *)0x1B0)
#define TS0          (*(volatile __near unsigned short *)0x1B2)
#define TS0L         (*(volatile __near unsigned char  *)0x1B2)
#define TS0L_bit     (*(volatile __near __bitf_T *)0x1B2)
#define TT0          (*(volatile __near unsigned short *)0x1B4)
#define TT0L         (*(volatile __near unsigned char  *)0x1B4)
#define TT0L_bit     (*(volatile __near __bitf_T *)0x1B4)
#define TPS0         (*(volatile __near unsigned short *)0x1B6)
#define TO0          (*(volatile __near unsigned short *)0x1B8)
#define TO0L         (*(volatile __near unsigned char  *)0x1B8)
#define TOE0         (*(volatile __near unsigned short *)0x1BA)
#define TOE0L        (*(volatile __near unsigned char  *)0x1BA)
#define TOE0L_bit    (*(volatile __near __bitf_T *)0x1BA)
#define TOL0         (*(volatile __near unsigned short *)0x1BC)
#define TOL0L        (*(volatile __near unsigned char  *)0x1BC)
#define TOM0         (*(volatile __near unsigned short *)0x1BE)
#define TOM0L        (*(volatile __near unsigned char  *)0x1BE)
#define TCR10        (*(volatile __near unsigned short *)0x1C0)
#define TCR11        (*(volatile __near unsigned short *)0x1C2)
#define TCR12        (*(volatile __near unsigned short *)0x1C4)
#define TCR13        (*(volatile __near unsigned short *)0x1C6)
#define TCR14        (*(volatile __near unsigned short *)0x1C8)
#define TCR15        (*(volatile __near unsigned short *)0x1CA)
#define TCR16        (*(volatile __near unsigned short *)0x1CC)
#define TCR17        (*(volatile __near unsigned short *)0x1CE)
#define TMR10        (*(volatile __near unsigned short *)0x1D0)
#define TMR11        (*(volatile __near unsigned short *)0x1D2)
#define TMR12        (*(volatile __near unsigned short *)0x1D4)
#define TMR13        (*(volatile __near unsigned short *)0x1D6)
#define TMR14        (*(volatile __near unsigned short *)0x1D8)
#define TMR15        (*(volatile __near unsigned short *)0x1DA)
#define TMR16        (*(volatile __near unsigned short *)0x1DC)
#define TMR17        (*(volatile __near unsigned short *)0x1DE)
#define TSR10        (*(volatile __near unsigned short *)0x1E0)
#define TSR10L       (*(volatile __near unsigned char  *)0x1E0)
#define TSR11        (*(volatile __near unsigned short *)0x1E2)
#define TSR11L       (*(volatile __near unsigned char  *)0x1E2)
#define TSR12        (*(volatile __near unsigned short *)0x1E4)
#define TSR12L       (*(volatile __near unsigned char  *)0x1E4)
#define TSR13        (*(volatile __near unsigned short *)0x1E6)
#define TSR13L       (*(volatile __near unsigned char  *)0x1E6)
#define TSR14        (*(volatile __near unsigned short *)0x1E8)
#define TSR14L       (*(volatile __near unsigned char  *)0x1E8)
#define TSR15        (*(volatile __near unsigned short *)0x1EA)
#define TSR15L       (*(volatile __near unsigned char  *)0x1EA)
#define TSR16        (*(volatile __near unsigned short *)0x1EC)
#define TSR16L       (*(volatile __near unsigned char  *)0x1EC)
#define TSR17        (*(volatile __near unsigned short *)0x1EE)
#define TSR17L       (*(volatile __near unsigned char  *)0x1EE)
#define TE1          (*(volatile __near unsigned short *)0x1F0)
#define TE1L         (*(volatile __near unsigned char  *)0x1F0)
#define TE1L_bit     (*(volatile __near __bitf_T *)0x1F0)
#define TS1          (*(volatile __near unsigned short *)0x1F2)
#define TS1L         (*(volatile __near unsigned char  *)0x1F2)
#define TS1L_bit     (*(volatile __near __bitf_T *)0x1F2)
#define TT1          (*(volatile __near unsigned short *)0x1F4)
#define TT1L         (*(volatile __near unsigned char  *)0x1F4)
#define TT1L_bit     (*(volatile __near __bitf_T *)0x1F4)
#define TPS1         (*(volatile __near unsigned short *)0x1F6)
#define TO1          (*(volatile __near unsigned short *)0x1F8)
#define TO1L         (*(volatile __near unsigned char  *)0x1F8)
#define TOE1         (*(volatile __near unsigned short *)0x1FA)
#define TOE1L        (*(volatile __near unsigned char  *)0x1FA)
#define TOE1L_bit    (*(volatile __near __bitf_T *)0x1FA)
#define TOL1         (*(volatile __near unsigned short *)0x1FC)
#define TOL1L        (*(volatile __near unsigned char  *)0x1FC)
#define TOM1         (*(volatile __near unsigned short *)0x1FE)
#define TOM1L        (*(volatile __near unsigned char  *)0x1FE)
#define TCR20        (*(volatile __near unsigned short *)0x200)
#define TCR21        (*(volatile __near unsigned short *)0x202)
#define TCR22        (*(volatile __near unsigned short *)0x204)
#define TCR23        (*(volatile __near unsigned short *)0x206)
#define TCR24        (*(volatile __near unsigned short *)0x208)
#define TCR25        (*(volatile __near unsigned short *)0x20A)
#define TCR26        (*(volatile __near unsigned short *)0x20C)
#define TCR27        (*(volatile __near unsigned short *)0x20E)
#define TMR20        (*(volatile __near unsigned short *)0x210)
#define TMR21        (*(volatile __near unsigned short *)0x212)
#define TMR22        (*(volatile __near unsigned short *)0x214)
#define TMR23        (*(volatile __near unsigned short *)0x216)
#define TMR24        (*(volatile __near unsigned short *)0x218)
#define TMR25        (*(volatile __near unsigned short *)0x21A)
#define TMR26        (*(volatile __near unsigned short *)0x21C)
#define TMR27        (*(volatile __near unsigned short *)0x21E)
#define TSR20        (*(volatile __near unsigned short *)0x220)
#define TSR20L       (*(volatile __near unsigned char  *)0x220)
#define TSR21        (*(volatile __near unsigned short *)0x222)
#define TSR21L       (*(volatile __near unsigned char  *)0x222)
#define TSR22        (*(volatile __near unsigned short *)0x224)
#define TSR22L       (*(volatile __near unsigned char  *)0x224)
#define TSR23        (*(volatile __near unsigned short *)0x226)
#define TSR23L       (*(volatile __near unsigned char  *)0x226)
#define TSR24        (*(volatile __near unsigned short *)0x228)
#define TSR24L       (*(volatile __near unsigned char  *)0x228)
#define TSR25        (*(volatile __near unsigned short *)0x22A)
#define TSR25L       (*(volatile __near unsigned char  *)0x22A)
#define TSR26        (*(volatile __near unsigned short *)0x22C)
#define TSR26L       (*(volatile __near unsigned char  *)0x22C)
#define TSR27        (*(volatile __near unsigned short *)0x22E)
#define TSR27L       (*(volatile __near unsigned char  *)0x22E)
#define TE2          (*(volatile __near unsigned short *)0x230)
#define TE2L         (*(volatile __near unsigned char  *)0x230)
#define TE2L_bit     (*(volatile __near __bitf_T *)0x230)
#define TS2          (*(volatile __near unsigned short *)0x232)
#define TS2L         (*(volatile __near unsigned char  *)0x232)
#define TS2L_bit     (*(volatile __near __bitf_T *)0x232)
#define TT2          (*(volatile __near unsigned short *)0x234)
#define TT2L         (*(volatile __near unsigned char  *)0x234)
#define TT2L_bit     (*(volatile __near __bitf_T *)0x234)
#define TPS2         (*(volatile __near unsigned short *)0x236)
#define TO2          (*(volatile __near unsigned short *)0x238)
#define TO2L         (*(volatile __near unsigned char  *)0x238)
#define TOE2         (*(volatile __near unsigned short *)0x23A)
#define TOE2L        (*(volatile __near unsigned char  *)0x23A)
#define TOE2L_bit    (*(volatile __near __bitf_T *)0x23A)
#define TOL2         (*(volatile __near unsigned short *)0x23C)
#define TOL2L        (*(volatile __near unsigned char  *)0x23C)
#define TOM2         (*(volatile __near unsigned short *)0x23E)
#define TOM2L        (*(volatile __near unsigned char  *)0x23E)
#define UF0CTL0      (*(volatile __near unsigned char  *)0x240)
#define UF0CTL0_bit  (*(volatile __near __bitf_T *)0x240)
#define UF0SL        (((volatile __near __bitf_T *)0x240)->no0)
#define UF0CL        (((volatile __near __bitf_T *)0x240)->no1)
#define UF0PS0       (((volatile __near __bitf_T *)0x240)->no2)
#define UF0PS1       (((volatile __near __bitf_T *)0x240)->no3)
#define UF0DIR       (((volatile __near __bitf_T *)0x240)->no4)
#define UF0RXE       (((volatile __near __bitf_T *)0x240)->no5)
#define UF0TXE       (((volatile __near __bitf_T *)0x240)->no6)
#define UF0OPT0      (*(volatile __near unsigned char  *)0x241)
#define UF0OPT0_bit  (*(volatile __near __bitf_T *)0x241)
#define UF0RDL       (((volatile __near __bitf_T *)0x241)->no0)
#define UF0TDL       (((volatile __near __bitf_T *)0x241)->no1)
#define UF0BLS0      (((volatile __near __bitf_T *)0x241)->no2)
#define UF0BLS1      (((volatile __near __bitf_T *)0x241)->no3)
#define UF0BLS2      (((volatile __near __bitf_T *)0x241)->no4)
#define UF0BTT       (((volatile __near __bitf_T *)0x241)->no5)
#define UF0BRT       (((volatile __near __bitf_T *)0x241)->no6)
#define UF0BRF       (((volatile __near __bitf_T *)0x241)->no7)
#define UF0CTL1      (*(volatile __near unsigned short *)0x242)
#define UF0OPT1      (*(volatile __near unsigned char  *)0x244)
#define UF0OPT1_bit  (*(volatile __near __bitf_T *)0x244)
#define UF0DCS       (((volatile __near __bitf_T *)0x244)->no0)
#define UF0MD0       (((volatile __near __bitf_T *)0x244)->no1)
#define UF0MD1       (((volatile __near __bitf_T *)0x244)->no2)
#define UF0ACE       (((volatile __near __bitf_T *)0x244)->no3)
#define UF0IPCS      (((volatile __near __bitf_T *)0x244)->no4)
#define UF0EBC       (((volatile __near __bitf_T *)0x244)->no5)
#define UF0EBL       (((volatile __near __bitf_T *)0x244)->no6)
#define UF0EBE       (((volatile __near __bitf_T *)0x244)->no7)
#define UF0OPT2      (*(volatile __near unsigned char  *)0x245)
#define UF0OPT2_bit  (*(volatile __near __bitf_T *)0x245)
#define UF0ITS       (((volatile __near __bitf_T *)0x245)->no0)
#define UF0RXFL      (((volatile __near __bitf_T *)0x245)->no1)
#define UF0STR       (*(volatile __near unsigned short *)0x246)
#define UF0STC       (*(volatile __near unsigned short *)0x248)
#define UF0WTX       (*(volatile __near unsigned short *)0x24A)
#define UF0WTXB      (*(volatile __near unsigned char  *)0x24A)
#define UF0ID        (*(volatile __near unsigned char  *)0x24E)
#define UF0BUF0      (*(volatile __near unsigned char  *)0x24F)
#define UF0BUF1      (*(volatile __near unsigned char  *)0x250)
#define UF0BUF2      (*(volatile __near unsigned char  *)0x251)
#define UF0BUF3      (*(volatile __near unsigned char  *)0x252)
#define UF0BUF4      (*(volatile __near unsigned char  *)0x253)
#define UF0BUF5      (*(volatile __near unsigned char  *)0x254)
#define UF0BUF6      (*(volatile __near unsigned char  *)0x255)
#define UF0BUF7      (*(volatile __near unsigned char  *)0x256)
#define UF0BUF8      (*(volatile __near unsigned char  *)0x257)
#define UF0BUCTL     (*(volatile __near unsigned short *)0x258)
#define UF1CTL0      (*(volatile __near unsigned char  *)0x260)
#define UF1CTL0_bit  (*(volatile __near __bitf_T *)0x260)
#define UF1SL        (((volatile __near __bitf_T *)0x260)->no0)
#define UF1CL        (((volatile __near __bitf_T *)0x260)->no1)
#define UF1PS0       (((volatile __near __bitf_T *)0x260)->no2)
#define UF1PS1       (((volatile __near __bitf_T *)0x260)->no3)
#define UF1DIR       (((volatile __near __bitf_T *)0x260)->no4)
#define UF1RXE       (((volatile __near __bitf_T *)0x260)->no5)
#define UF1TXE       (((volatile __near __bitf_T *)0x260)->no6)
#define UF1OPT0      (*(volatile __near unsigned char  *)0x261)
#define UF1OPT0_bit  (*(volatile __near __bitf_T *)0x261)
#define UF1RDL       (((volatile __near __bitf_T *)0x261)->no0)
#define UF1TDL       (((volatile __near __bitf_T *)0x261)->no1)
#define UF1BLS0      (((volatile __near __bitf_T *)0x261)->no2)
#define UF1BLS1      (((volatile __near __bitf_T *)0x261)->no3)
#define UF1BLS2      (((volatile __near __bitf_T *)0x261)->no4)
#define UF1BTT       (((volatile __near __bitf_T *)0x261)->no5)
#define UF1BRT       (((volatile __near __bitf_T *)0x261)->no6)
#define UF1BRF       (((volatile __near __bitf_T *)0x261)->no7)
#define UF1CTL1      (*(volatile __near unsigned short *)0x262)
#define UF1OPT1      (*(volatile __near unsigned char  *)0x264)
#define UF1OPT1_bit  (*(volatile __near __bitf_T *)0x264)
#define UF1DCS       (((volatile __near __bitf_T *)0x264)->no0)
#define UF1MD0       (((volatile __near __bitf_T *)0x264)->no1)
#define UF1MD1       (((volatile __near __bitf_T *)0x264)->no2)
