Nadir-KT/Programming-Languages/DSA/DFL/11-CSP_CCRL_R5F104PJ_DataFlash_v3/R5F10DPL.001/iodefine.h
#define UF1ACE       (((volatile __near __bitf_T *)0x264)->no3)
#define UF1IPCS      (((volatile __near __bitf_T *)0x264)->no4)
#define UF1EBC       (((volatile __near __bitf_T *)0x264)->no5)
#define UF1EBL       (((volatile __near __bitf_T *)0x264)->no6)
#define UF1EBE       (((volatile __near __bitf_T *)0x264)->no7)
#define UF1OPT2      (*(volatile __near unsigned char  *)0x265)
#define UF1OPT2_bit  (*(volatile __near __bitf_T *)0x265)
#define UF1ITS       (((volatile __near __bitf_T *)0x265)->no0)
#define UF1RXFL      (((volatile __near __bitf_T *)0x265)->no1)
#define UF1STR       (*(volatile __near unsigned short *)0x266)
#define UF1STC       (*(volatile __near unsigned short *)0x268)
#define UF1WTX       (*(volatile __near unsigned short *)0x26A)
#define UF1WTXB      (*(volatile __near unsigned char  *)0x26A)
#define UF1ID        (*(volatile __near unsigned char  *)0x26E)
#define UF1BUF0      (*(volatile __near unsigned char  *)0x26F)
#define UF1BUF1      (*(volatile __near unsigned char  *)0x270)
#define UF1BUF2      (*(volatile __near unsigned char  *)0x271)
#define UF1BUF3      (*(volatile __near unsigned char  *)0x272)
#define UF1BUF4      (*(volatile __near unsigned char  *)0x273)
#define UF1BUF5      (*(volatile __near unsigned char  *)0x274)
#define UF1BUF6      (*(volatile __near unsigned char  *)0x275)
#define UF1BUF7      (*(volatile __near unsigned char  *)0x276)
#define UF1BUF8      (*(volatile __near unsigned char  *)0x277)
#define UF1BUCTL     (*(volatile __near unsigned short *)0x278)
#define SG0FL        (*(volatile __near unsigned short *)0x280)
#define SG0FH        (*(volatile __near unsigned short *)0x282)
#define SG0PWM       (*(volatile __near unsigned short *)0x284)
#define SG0SDF       (*(volatile __near unsigned char  *)0x286)
#define SG0CTL       (*(volatile __near unsigned char  *)0x287)
#define SG0CTL_bit   (*(volatile __near __bitf_T *)0x287)
#define SG0ALDS      (((volatile __near __bitf_T *)0x287)->no0)
#define SG0OS        (((volatile __near __bitf_T *)0x287)->no1)
#define SG0PWR       (((volatile __near __bitf_T *)0x287)->no4)
#define SG0ITH       (*(volatile __near unsigned short *)0x288)
#define CRC0CTL      (*(volatile __near unsigned char  *)0x2F0)
#define CRC0CTL_bit  (*(volatile __near __bitf_T *)0x2F0)
#define FEA0         (((volatile __near __bitf_T *)0x2F0)->no0)
#define FEA1         (((volatile __near __bitf_T *)0x2F0)->no1)
#define FEA2         (((volatile __near __bitf_T *)0x2F0)->no2)
#define FEA3         (((volatile __near __bitf_T *)0x2F0)->no3)
#define FEA4         (((volatile __near __bitf_T *)0x2F0)->no4)
#define FEA5         (((volatile __near __bitf_T *)0x2F0)->no5)
#define CRC0EN       (((volatile __near __bitf_T *)0x2F0)->no7)
#define PGCRCL       (*(volatile __near unsigned short *)0x2F2)
#define CRCD         (*(volatile __near unsigned short *)0x2FA)
#define SEG0         (*(volatile __near unsigned char  *)0x300)
#define SEG1         (*(volatile __near unsigned char  *)0x301)
#define SEG2         (*(volatile __near unsigned char  *)0x302)
#define SEG3         (*(volatile __near unsigned char  *)0x303)
#define SEG4         (*(volatile __near unsigned char  *)0x304)
#define SEG5         (*(volatile __near unsigned char  *)0x305)
#define SEG6         (*(volatile __near unsigned char  *)0x306)
#define SEG7         (*(volatile __near unsigned char  *)0x307)
#define SEG8         (*(volatile __near unsigned char  *)0x308)
#define SEG9         (*(volatile __near unsigned char  *)0x309)
#define SEG10        (*(volatile __near unsigned char  *)0x30A)
#define SEG11        (*(volatile __near unsigned char  *)0x30B)
#define SEG12        (*(volatile __near unsigned char  *)0x30C)
#define SEG13        (*(volatile __near unsigned char  *)0x30D)
#define SEG14        (*(volatile __near unsigned char  *)0x30E)
#define SEG15        (*(volatile __near unsigned char  *)0x30F)
#define SEG16        (*(volatile __near unsigned char  *)0x310)
#define SEG17        (*(volatile __near unsigned char  *)0x311)
#define SEG18        (*(volatile __near unsigned char  *)0x312)
#define SEG19        (*(volatile __near unsigned char  *)0x313)
#define SEG20        (*(volatile __near unsigned char  *)0x314)
#define SEG21        (*(volatile __near unsigned char  *)0x315)
#define SEG22        (*(volatile __near unsigned char  *)0x316)
#define SEG23        (*(volatile __near unsigned char  *)0x317)
#define SEG24        (*(volatile __near unsigned char  *)0x318)
#define SEG25        (*(volatile __near unsigned char  *)0x319)
#define SEG26        (*(volatile __near unsigned char  *)0x31A)
#define SEG27        (*(volatile __near unsigned char  *)0x31B)
#define SEG28        (*(volatile __near unsigned char  *)0x31C)
#define SEG29        (*(volatile __near unsigned char  *)0x31D)
#define SEG30        (*(volatile __near unsigned char  *)0x31E)
#define SEG31        (*(volatile __near unsigned char  *)0x31F)
#define SEG32        (*(volatile __near unsigned char  *)0x320)
#define SEG33        (*(volatile __near unsigned char  *)0x321)
#define SEG34        (*(volatile __near unsigned char  *)0x322)
#define SEG35        (*(volatile __near unsigned char  *)0x323)
#define SEG36        (*(volatile __near unsigned char  *)0x324)
#define SEG37        (*(volatile __near unsigned char  *)0x325)
#define SEG38        (*(volatile __near unsigned char  *)0x326)
#define SEG39        (*(volatile __near unsigned char  *)0x327)
#define SEG40        (*(volatile __near unsigned char  *)0x328)
#define SEG41        (*(volatile __near unsigned char  *)0x329)
#define SEG42        (*(volatile __near unsigned char  *)0x32A)
#define SEG43        (*(volatile __near unsigned char  *)0x32B)
#define SEG44        (*(volatile __near unsigned char  *)0x32C)
#define SEG45        (*(volatile __near unsigned char  *)0x32D)
#define SEG46        (*(volatile __near unsigned char  *)0x32E)
#define SEG47        (*(volatile __near unsigned char  *)0x32F)
#define SEG48        (*(volatile __near unsigned char  *)0x330)
#define SEG49        (*(volatile __near unsigned char  *)0x331)
#define SEG50        (*(volatile __near unsigned char  *)0x332)
#define SEG51        (*(volatile __near unsigned char  *)0x333)
#define SEG52        (*(volatile __near unsigned char  *)0x334)
#define C1GMCTRL     (*(volatile __near unsigned short *)0x340)
#define C1GMCS       (*(volatile __near unsigned char  *)0x342)
#define C1GMABT      (*(volatile __near unsigned short *)0x346)
#define C1GMABTD     (*(volatile __near unsigned char  *)0x348)
#define C1MASK1L     (*(volatile __near unsigned short *)0x380)
#define C1MASK1H     (*(volatile __near unsigned short *)0x382)
#define C1MASK2L     (*(volatile __near unsigned short *)0x384)
#define C1MASK2H     (*(volatile __near unsigned short *)0x386)
#define C1MASK3L     (*(volatile __near unsigned short *)0x388)
#define C1MASK3H     (*(volatile __near unsigned short *)0x38A)
#define C1MASK4L     (*(volatile __near unsigned short *)0x38C)
#define C1MASK4H     (*(volatile __near unsigned short *)0x38E)
#define C1CTRL       (*(volatile __near unsigned short *)0x390)
#define C1LEC        (*(volatile __near unsigned char  *)0x392)
#define C1INFO       (*(volatile __near unsigned char  *)0x393)
#define C1ERC        (*(volatile __near unsigned short *)0x394)
#define C1IE         (*(volatile __near unsigned short *)0x396)
#define C1INTS       (*(volatile __near unsigned short *)0x398)
#define C1BRP        (*(volatile __near unsigned char  *)0x39A)
#define C1BTR        (*(volatile __near unsigned short *)0x39C)
#define C1LIPT       (*(volatile __near unsigned char  *)0x39E)
#define C1RGPT       (*(volatile __near unsigned short *)0x3A0)
#define C1LOPT       (*(volatile __near unsigned char  *)0x3A2)
#define C1TGPT       (*(volatile __near unsigned short *)0x3A4)
#define C1TS         (*(volatile __near unsigned short *)0x3A6)
#define C1MDB0100    (*(volatile __near unsigned short *)0x400)
#define C1MDB000     (*(volatile __near unsigned char  *)0x400)
#define C1MDB100     (*(volatile __near unsigned char  *)0x401)
#define C1MDB2300    (*(volatile __near unsigned short *)0x402)
#define C1MDB200     (*(volatile __near unsigned char  *)0x402)
#define C1MDB300     (*(volatile __near unsigned char  *)0x403)
#define C1MDB4500    (*(volatile __near unsigned short *)0x404)
#define C1MDB400     (*(volatile __near unsigned char  *)0x404)
#define C1MDB500     (*(volatile __near unsigned char  *)0x405)
#define C1MDB6700    (*(volatile __near unsigned short *)0x406)
#define C1MDB600     (*(volatile __near unsigned char  *)0x406)
#define C1MDB700     (*(volatile __near unsigned char  *)0x407)
#define C1MDLC00     (*(volatile __near unsigned char  *)0x408)
#define C1MCONF00    (*(volatile __near unsigned char  *)0x409)
#define C1MIDL00     (*(volatile __near unsigned short *)0x40A)
#define C1MIDH00     (*(volatile __near unsigned short *)0x40C)
#define C1MCTRL00    (*(volatile __near unsigned short *)0x40E)
#define C1MDB0101    (*(volatile __near unsigned short *)0x410)
#define C1MDB001     (*(volatile __near unsigned char  *)0x410)
#define C1MDB101     (*(volatile __near unsigned char  *)0x411)
#define C1MDB2301    (*(volatile __near unsigned short *)0x412)
#define C1MDB201     (*(volatile __near unsigned char  *)0x412)
#define C1MDB301     (*(volatile __near unsigned char  *)0x413)
#define C1MDB4501    (*(volatile __near unsigned short *)0x414)
#define C1MDB401     (*(volatile __near unsigned char  *)0x414)
#define C1MDB501     (*(volatile __near unsigned char  *)0x415)
#define C1MDB6701    (*(volatile __near unsigned short *)0x416)
#define C1MDB601     (*(volatile __near unsigned char  *)0x416)
#define C1MDB701     (*(volatile __near unsigned char  *)0x417)
#define C1MDLC01     (*(volatile __near unsigned char  *)0x418)
#define C1MCONF01    (*(volatile __near unsigned char  *)0x419)
#define C1MIDL01     (*(volatile __near unsigned short *)0x41A)
#define C1MIDH01     (*(volatile __near unsigned short *)0x41C)
#define C1MCTRL01    (*(volatile __near unsigned short *)0x41E)
#define C1MDB0102    (*(volatile __near unsigned short *)0x420)
#define C1MDB002     (*(volatile __near unsigned char  *)0x420)
#define C1MDB102     (*(volatile __near unsigned char  *)0x421)
#define C1MDB2302    (*(volatile __near unsigned short *)0x422)
#define C1MDB202     (*(volatile __near unsigned char  *)0x422)
#define C1MDB302     (*(volatile __near unsigned char  *)0x423)
#define C1MDB4502    (*(volatile __near unsigned short *)0x424)
#define C1MDB402     (*(volatile __near unsigned char  *)0x424)
#define C1MDB502     (*(volatile __near unsigned char  *)0x425)
#define C1MDB6702    (*(volatile __near unsigned short *)0x426)
#define C1MDB602     (*(volatile __near unsigned char  *)0x426)
#define C1MDB702     (*(volatile __near unsigned char  *)0x427)
#define C1MDLC02     (*(volatile __near unsigned char  *)0x428)
#define C1MCONF02    (*(volatile __near unsigned char  *)0x429)
#define C1MIDL02     (*(volatile __near unsigned short *)0x42A)
#define C1MIDH02     (*(volatile __near unsigned short *)0x42C)
#define C1MCTRL02    (*(volatile __near unsigned short *)0x42E)
#define C1MDB0103    (*(volatile __near unsigned short *)0x430)
#define C1MDB003     (*(volatile __near unsigned char  *)0x430)
#define C1MDB103     (*(volatile __near unsigned char  *)0x431)
#define C1MDB2303    (*(volatile __near unsigned short *)0x432)
#define C1MDB203     (*(volatile __near unsigned char  *)0x432)
#define C1MDB303     (*(volatile __near unsigned char  *)0x433)
#define C1MDB4503    (*(volatile __near unsigned short *)0x434)
#define C1MDB403     (*(volatile __near unsigned char  *)0x434)
#define C1MDB503     (*(volatile __near unsigned char  *)0x435)
#define C1MDB6703    (*(volatile __near unsigned short *)0x436)
#define C1MDB603     (*(volatile __near unsigned char  *)0x436)
#define C1MDB703     (*(volatile __near unsigned char  *)0x437)
#define C1MDLC03     (*(volatile __near unsigned char  *)0x438)
#define C1MCONF03    (*(volatile __near unsigned char  *)0x439)
#define C1MIDL03     (*(volatile __near unsigned short *)0x43A)
#define C1MIDH03     (*(volatile __near unsigned short *)0x43C)
#define C1MCTRL03    (*(volatile __near unsigned short *)0x43E)
#define C1MDB0104    (*(volatile __near unsigned short *)0x440)
#define C1MDB004     (*(volatile __near unsigned char  *)0x440)
#define C1MDB104     (*(volatile __near unsigned char  *)0x441)
#define C1MDB2304    (*(volatile __near unsigned short *)0x442)
#define C1MDB204     (*(volatile __near unsigned char  *)0x442)
#define C1MDB304     (*(volatile __near unsigned char  *)0x443)
#define C1MDB4504    (*(volatile __near unsigned short *)0x444)
#define C1MDB404     (*(volatile __near unsigned char  *)0x444)
#define C1MDB504     (*(volatile __near unsigned char  *)0x445)
#define C1MDB6704    (*(volatile __near unsigned short *)0x446)
#define C1MDB604     (*(volatile __near unsigned char  *)0x446)
#define C1MDB704     (*(volatile __near unsigned char  *)0x447)
#define C1MDLC04     (*(volatile __near unsigned char  *)0x448)
#define C1MCONF04    (*(volatile __near unsigned char  *)0x449)
#define C1MIDL04     (*(volatile __near unsigned short *)0x44A)
#define C1MIDH04     (*(volatile __near unsigned short *)0x44C)
#define C1MCTRL04    (*(volatile __near unsigned short *)0x44E)
#define C1MDB0105    (*(volatile __near unsigned short *)0x450)
#define C1MDB005     (*(volatile __near unsigned char  *)0x450)
#define C1MDB105     (*(volatile __near unsigned char  *)0x451)
#define C1MDB2305    (*(volatile __near unsigned short *)0x452)
#define C1MDB205     (*(volatile __near unsigned char  *)0x452)
#define C1MDB305     (*(volatile __near unsigned char  *)0x453)
#define C1MDB4505    (*(volatile __near unsigned short *)0x454)
#define C1MDB405     (*(volatile __near unsigned char  *)0x454)
#define C1MDB505     (*(volatile __near unsigned char  *)0x455)
#define C1MDB6705    (*(volatile __near unsigned short *)0x456)
#define C1MDB605     (*(volatile __near unsigned char  *)0x456)
#define C1MDB705     (*(volatile __near unsigned char  *)0x457)
#define C1MDLC05     (*(volatile __near unsigned char  *)0x458)
#define C1MCONF05    (*(volatile __near unsigned char  *)0x459)
#define C1MIDL05     (*(volatile __near unsigned short *)0x45A)
#define C1MIDH05     (*(volatile __near unsigned short *)0x45C)
#define C1MCTRL05    (*(volatile __near unsigned short *)0x45E)
#define C1MDB0106    (*(volatile __near unsigned short *)0x460)
#define C1MDB006     (*(volatile __near unsigned char  *)0x460)
#define C1MDB106     (*(volatile __near unsigned char  *)0x461)
#define C1MDB2306    (*(volatile __near unsigned short *)0x462)
#define C1MDB206     (*(volatile __near unsigned char  *)0x462)
#define C1MDB306     (*(volatile __near unsigned char  *)0x463)
#define C1MDB4506    (*(volatile __near unsigned short *)0x464)
#define C1MDB406     (*(volatile __near unsigned char  *)0x464)
#define C1MDB506     (*(volatile __near unsigned char  *)0x465)
#define C1MDB6706    (*(volatile __near unsigned short *)0x466)
#define C1MDB606     (*(volatile __near unsigned char  *)0x466)
#define C1MDB706     (*(volatile __near unsigned char  *)0x467)
#define C1MDLC06     (*(volatile __near unsigned char  *)0x468)
#define C1MCONF06    (*(volatile __near unsigned char  *)0x469)
#define C1MIDL06     (*(volatile __near unsigned short *)0x46A)
#define C1MIDH06     (*(volatile __near unsigned short *)0x46C)
#define C1MCTRL06    (*(volatile __near unsigned short *)0x46E)
#define C1MDB0107    (*(volatile __near unsigned short *)0x470)
#define C1MDB007     (*(volatile __near unsigned char  *)0x470)
#define C1MDB107     (*(volatile __near unsigned char  *)0x471)
#define C1MDB2307    (*(volatile __near unsigned short *)0x472)
#define C1MDB207     (*(volatile __near unsigned char  *)0x472)
#define C1MDB307     (*(volatile __near unsigned char  *)0x473)
#define C1MDB4507    (*(volatile __near unsigned short *)0x474)
#define C1MDB407     (*(volatile __near unsigned char  *)0x474)
#define C1MDB507     (*(volatile __near unsigned char  *)0x475)
#define C1MDB6707    (*(volatile __near unsigned short *)0x476)
#define C1MDB607     (*(volatile __near unsigned char  *)0x476)
#define C1MDB707     (*(volatile __near unsigned char  *)0x477)
#define C1MDLC07     (*(volatile __near unsigned char  *)0x478)
#define C1MCONF07    (*(volatile __near unsigned char  *)0x479)
#define C1MIDL07     (*(volatile __near unsigned short *)0x47A)
#define C1MIDH07     (*(volatile __near unsigned short *)0x47C)
#define C1MCTRL07    (*(volatile __near unsigned short *)0x47E)
#define C1MDB0108    (*(volatile __near unsigned short *)0x480)
#define C1MDB008     (*(volatile __near unsigned char  *)0x480)
#define C1MDB108     (*(volatile __near unsigned char  *)0x481)
#define C1MDB2308    (*(volatile __near unsigned short *)0x482)
#define C1MDB208     (*(volatile __near unsigned char  *)0x482)
#define C1MDB308     (*(volatile __near unsigned char  *)0x483)
#define C1MDB4508    (*(volatile __near unsigned short *)0x484)
#define C1MDB408     (*(volatile __near unsigned char  *)0x484)
#define C1MDB508     (*(volatile __near unsigned char  *)0x485)
#define C1MDB6708    (*(volatile __near unsigned short *)0x486)
#define C1MDB608     (*(volatile __near unsigned char  *)0x486)
#define C1MDB708     (*(volatile __near unsigned char  *)0x487)
#define C1MDLC08     (*(volatile __near unsigned char  *)0x488)
#define C1MCONF08    (*(volatile __near unsigned char  *)0x489)
#define C1MIDL08     (*(volatile __near unsigned short *)0x48A)
#define C1MIDH08     (*(volatile __near unsigned short *)0x48C)
#define C1MCTRL08    (*(volatile __near unsigned short *)0x48E)
#define C1MDB0109    (*(volatile __near unsigned short *)0x490)
#define C1MDB009     (*(volatile __near unsigned char  *)0x490)
#define C1MDB109     (*(volatile __near unsigned char  *)0x491)
#define C1MDB2309    (*(volatile __near unsigned short *)0x492)
#define C1MDB209     (*(volatile __near unsigned char  *)0x492)
#define C1MDB309     (*(volatile __near unsigned char  *)0x493)
#define C1MDB4509    (*(volatile __near unsigned short *)0x494)
#define C1MDB409     (*(volatile __near unsigned char  *)0x494)
#define C1MDB509     (*(volatile __near unsigned char  *)0x495)
#define C1MDB6709    (*(volatile __near unsigned short *)0x496)
#define C1MDB609     (*(volatile __near unsigned char  *)0x496)
#define C1MDB709     (*(volatile __near unsigned char  *)0x497)
#define C1MDLC09     (*(volatile __near unsigned char  *)0x498)
#define C1MCONF09    (*(volatile __near unsigned char  *)0x499)
#define C1MIDL09     (*(volatile __near unsigned short *)0x49A)
#define C1MIDH09     (*(volatile __near unsigned short *)0x49C)
#define C1MCTRL09    (*(volatile __near unsigned short *)0x49E)
#define C1MDB0110    (*(volatile __near unsigned short *)0x4A0)
#define C1MDB010     (*(volatile __near unsigned char  *)0x4A0)
#define C1MDB110     (*(volatile __near unsigned char  *)0x4A1)
#define C1MDB2310    (*(volatile __near unsigned short *)0x4A2)
#define C1MDB210     (*(volatile __near unsigned char  *)0x4A2)
#define C1MDB310     (*(volatile __near unsigned char  *)0x4A3)
#define C1MDB4510    (*(volatile __near unsigned short *)0x4A4)
#define C1MDB410     (*(volatile __near unsigned char  *)0x4A4)
#define C1MDB510     (*(volatile __near unsigned char  *)0x4A5)
#define C1MDB6710    (*(volatile __near unsigned short *)0x4A6)
#define C1MDB610     (*(volatile __near unsigned char  *)0x4A6)
#define C1MDB710     (*(volatile __near unsigned char  *)0x4A7)
#define C1MDLC10     (*(volatile __near unsigned char  *)0x4A8)
#define C1MCONF10    (*(volatile __near unsigned char  *)0x4A9)
#define C1MIDL10     (*(volatile __near unsigned short *)0x4AA)
#define C1MIDH10     (*(volatile __near unsigned short *)0x4AC)
#define C1MCTRL10    (*(volatile __near unsigned short *)0x4AE)
#define C1MDB0111    (*(volatile __near unsigned short *)0x4B0)
#define C1MDB011     (*(volatile __near unsigned char  *)0x4B0)
#define C1MDB111     (*(volatile __near unsigned char  *)0x4B1)
#define C1MDB2311    (*(volatile __near unsigned short *)0x4B2)
#define C1MDB211     (*(volatile __near unsigned char  *)0x4B2)
#define C1MDB311     (*(volatile __near unsigned char  *)0x4B3)
#define C1MDB4511    (*(volatile __near unsigned short *)0x4B4)
#define C1MDB411     (*(volatile __near unsigned char  *)0x4B4)
#define C1MDB511     (*(volatile __near unsigned char  *)0x4B5)
#define C1MDB6711    (*(volatile __near unsigned short *)0x4B6)
#define C1MDB611     (*(volatile __near unsigned char  *)0x4B6)
#define C1MDB711     (*(volatile __near unsigned char  *)0x4B7)
#define C1MDLC11     (*(volatile __near unsigned char  *)0x4B8)
#define C1MCONF11    (*(volatile __near unsigned char  *)0x4B9)
#define C1MIDL11     (*(volatile __near unsigned short *)0x4BA)
#define C1MIDH11     (*(volatile __near unsigned short *)0x4BC)
#define C1MCTRL11    (*(volatile __near unsigned short *)0x4BE)
#define C1MDB0112    (*(volatile __near unsigned short *)0x4C0)
#define C1MDB012     (*(volatile __near unsigned char  *)0x4C0)
#define C1MDB112     (*(volatile __near unsigned char  *)0x4C1)
#define C1MDB2312    (*(volatile __near unsigned short *)0x4C2)
#define C1MDB212     (*(volatile __near unsigned char  *)0x4C2)
#define C1MDB312     (*(volatile __near unsigned char  *)0x4C3)
#define C1MDB4512    (*(volatile __near unsigned short *)0x4C4)
#define C1MDB412     (*(volatile __near unsigned char  *)0x4C4)
#define C1MDB512     (*(volatile __near unsigned char  *)0x4C5)
#define C1MDB6712    (*(volatile __near unsigned short *)0x4C6)
#define C1MDB612     (*(volatile __near unsigned char  *)0x4C6)
#define C1MDB712     (*(volatile __near unsigned char  *)0x4C7)
#define C1MDLC12     (*(volatile __near unsigned char  *)0x4C8)
#define C1MCONF12    (*(volatile __near unsigned char  *)0x4C9)
#define C1MIDL12     (*(volatile __near unsigned short *)0x4CA)
#define C1MIDH12     (*(volatile __near unsigned short *)0x4CC)
#define C1MCTRL12    (*(volatile __near unsigned short *)0x4CE)
#define C1MDB0113    (*(volatile __near unsigned short *)0x4D0)
#define C1MDB013     (*(volatile __near unsigned char  *)0x4D0)
#define C1MDB113     (*(volatile __near unsigned char  *)0x4D1)
#define C1MDB2313    (*(volatile __near unsigned short *)0x4D2)
#define C1MDB213     (*(volatile __near unsigned char  *)0x4D2)
#define C1MDB313     (*(volatile __near unsigned char  *)0x4D3)
#define C1MDB4513    (*(volatile __near unsigned short *)0x4D4)
#define C1MDB413     (*(volatile __near unsigned char  *)0x4D4)
#define C1MDB513     (*(volatile __near unsigned char  *)0x4D5)
#define C1MDB6713    (*(volatile __near unsigned short *)0x4D6)
#define C1MDB613     (*(volatile __near unsigned char  *)0x4D6)
#define C1MDB713     (*(volatile __near unsigned char  *)0x4D7)
#define C1MDLC13     (*(volatile __near unsigned char  *)0x4D8)
#define C1MCONF13    (*(volatile __near unsigned char  *)0x4D9)
#define C1MIDL13     (*(volatile __near unsigned short *)0x4DA)
#define C1MIDH13     (*(volatile __near unsigned short *)0x4DC)
#define C1MCTRL13    (*(volatile __near unsigned short *)0x4DE)
#define C1MDB0114    (*(volatile __near unsigned short *)0x4E0)
#define C1MDB014     (*(volatile __near unsigned char  *)0x4E0)
#define C1MDB114     (*(volatile __near unsigned char  *)0x4E1)
#define C1MDB2314    (*(volatile __near unsigned short *)0x4E2)
#define C1MDB214     (*(volatile __near unsigned char  *)0x4E2)
#define C1MDB314     (*(volatile __near unsigned char  *)0x4E3)
#define C1MDB4514    (*(volatile __near unsigned short *)0x4E4)
#define C1MDB414     (*(volatile __near unsigned char  *)0x4E4)
#define C1MDB514     (*(volatile __near unsigned char  *)0x4E5)
#define C1MDB6714    (*(volatile __near unsigned short *)0x4E6)
#define C1MDB614     (*(volatile __near unsigned char  *)0x4E6)
#define C1MDB714     (*(volatile __near unsigned char  *)0x4E7)
#define C1MDLC14     (*(volatile __near unsigned char  *)0x4E8)
#define C1MCONF14    (*(volatile __near unsigned char  *)0x4E9)
