Nadir-KT/Programming-Languages/DSA/DFL/11-CSP_CCRL_R5F104PJ_DataFlash_v3/R5F10DPL.001/iodefine.h
#define C1MIDL14     (*(volatile __near unsigned short *)0x4EA)
#define C1MIDH14     (*(volatile __near unsigned short *)0x4EC)
#define C1MCTRL14    (*(volatile __near unsigned short *)0x4EE)
#define C1MDB0115    (*(volatile __near unsigned short *)0x4F0)
#define C1MDB015     (*(volatile __near unsigned char  *)0x4F0)
#define C1MDB115     (*(volatile __near unsigned char  *)0x4F1)
#define C1MDB2315    (*(volatile __near unsigned short *)0x4F2)
#define C1MDB215     (*(volatile __near unsigned char  *)0x4F2)
#define C1MDB315     (*(volatile __near unsigned char  *)0x4F3)
#define C1MDB4515    (*(volatile __near unsigned short *)0x4F4)
#define C1MDB415     (*(volatile __near unsigned char  *)0x4F4)
#define C1MDB515     (*(volatile __near unsigned char  *)0x4F5)
#define C1MDB6715    (*(volatile __near unsigned short *)0x4F6)
#define C1MDB615     (*(volatile __near unsigned char  *)0x4F6)
#define C1MDB715     (*(volatile __near unsigned char  *)0x4F7)
#define C1MDLC15     (*(volatile __near unsigned char  *)0x4F8)
#define C1MCONF15    (*(volatile __near unsigned char  *)0x4F9)
#define C1MIDL15     (*(volatile __near unsigned short *)0x4FA)
#define C1MIDH15     (*(volatile __near unsigned short *)0x4FC)
#define C1MCTRL15    (*(volatile __near unsigned short *)0x4FE)
#define C0GMCTRL     (*(volatile __near unsigned short *)0x5C0)
#define C0GMABT      (*(volatile __near unsigned short *)0x5C6)
#define C0GMABTD     (*(volatile __near unsigned char  *)0x5C8)
#define C0GMCS       (*(volatile __near unsigned char  *)0x5CE)
#define C0MASK1L     (*(volatile __near unsigned short *)0x5D0)
#define C0MASK1H     (*(volatile __near unsigned short *)0x5D2)
#define C0MASK2L     (*(volatile __near unsigned short *)0x5D4)
#define C0MASK2H     (*(volatile __near unsigned short *)0x5D6)
#define C0MASK3L     (*(volatile __near unsigned short *)0x5D8)
#define C0MASK3H     (*(volatile __near unsigned short *)0x5DA)
#define C0MASK4L     (*(volatile __near unsigned short *)0x5DC)
#define C0MASK4H     (*(volatile __near unsigned short *)0x5DE)
#define C0CTRL       (*(volatile __near unsigned short *)0x5E0)
#define C0LEC        (*(volatile __near unsigned char  *)0x5E2)
#define C0INFO       (*(volatile __near unsigned char  *)0x5E3)
#define C0ERC        (*(volatile __near unsigned short *)0x5E4)
#define C0IE         (*(volatile __near unsigned short *)0x5E6)
#define C0INTS       (*(volatile __near unsigned short *)0x5E8)
#define C0BRP        (*(volatile __near unsigned char  *)0x5EA)
#define C0BTR        (*(volatile __near unsigned short *)0x5EC)
#define C0LIPT       (*(volatile __near unsigned char  *)0x5EE)
#define C0RGPT       (*(volatile __near unsigned short *)0x5F0)
#define C0LOPT       (*(volatile __near unsigned char  *)0x5F2)
#define C0TGPT       (*(volatile __near unsigned short *)0x5F4)
#define C0TS         (*(volatile __near unsigned short *)0x5F6)
#define C0MDB0100    (*(volatile __near unsigned short *)0x600)
#define C0MDB000     (*(volatile __near unsigned char  *)0x600)
#define C0MDB100     (*(volatile __near unsigned char  *)0x601)
#define C0MDB2300    (*(volatile __near unsigned short *)0x602)
#define C0MDB200     (*(volatile __near unsigned char  *)0x602)
#define C0MDB300     (*(volatile __near unsigned char  *)0x603)
#define C0MDB4500    (*(volatile __near unsigned short *)0x604)
#define C0MDB400     (*(volatile __near unsigned char  *)0x604)
#define C0MDB500     (*(volatile __near unsigned char  *)0x605)
#define C0MDB6700    (*(volatile __near unsigned short *)0x606)
#define C0MDB600     (*(volatile __near unsigned char  *)0x606)
#define C0MDB700     (*(volatile __near unsigned char  *)0x607)
#define C0MDLC00     (*(volatile __near unsigned char  *)0x608)
#define C0MCONF00    (*(volatile __near unsigned char  *)0x609)
#define C0MIDL00     (*(volatile __near unsigned short *)0x60A)
#define C0MIDH00     (*(volatile __near unsigned short *)0x60C)
#define C0MCTRL00    (*(volatile __near unsigned short *)0x60E)
#define C0MDB0101    (*(volatile __near unsigned short *)0x610)
#define C0MDB001     (*(volatile __near unsigned char  *)0x610)
#define C0MDB101     (*(volatile __near unsigned char  *)0x611)
#define C0MDB2301    (*(volatile __near unsigned short *)0x612)
#define C0MDB201     (*(volatile __near unsigned char  *)0x612)
#define C0MDB301     (*(volatile __near unsigned char  *)0x613)
#define C0MDB4501    (*(volatile __near unsigned short *)0x614)
#define C0MDB401     (*(volatile __near unsigned char  *)0x614)
#define C0MDB501     (*(volatile __near unsigned char  *)0x615)
#define C0MDB6701    (*(volatile __near unsigned short *)0x616)
#define C0MDB601     (*(volatile __near unsigned char  *)0x616)
#define C0MDB701     (*(volatile __near unsigned char  *)0x617)
#define C0MDLC01     (*(volatile __near unsigned char  *)0x618)
#define C0MCONF01    (*(volatile __near unsigned char  *)0x619)
#define C0MIDL01     (*(volatile __near unsigned short *)0x61A)
#define C0MIDH01     (*(volatile __near unsigned short *)0x61C)
#define C0MCTRL01    (*(volatile __near unsigned short *)0x61E)
#define C0MDB0102    (*(volatile __near unsigned short *)0x620)
#define C0MDB002     (*(volatile __near unsigned char  *)0x620)
#define C0MDB102     (*(volatile __near unsigned char  *)0x621)
#define C0MDB2302    (*(volatile __near unsigned short *)0x622)
#define C0MDB202     (*(volatile __near unsigned char  *)0x622)
#define C0MDB302     (*(volatile __near unsigned char  *)0x623)
#define C0MDB4502    (*(volatile __near unsigned short *)0x624)
#define C0MDB402     (*(volatile __near unsigned char  *)0x624)
#define C0MDB502     (*(volatile __near unsigned char  *)0x625)
#define C0MDB6702    (*(volatile __near unsigned short *)0x626)
#define C0MDB602     (*(volatile __near unsigned char  *)0x626)
#define C0MDB702     (*(volatile __near unsigned char  *)0x627)
#define C0MDLC02     (*(volatile __near unsigned char  *)0x628)
#define C0MCONF02    (*(volatile __near unsigned char  *)0x629)
#define C0MIDL02     (*(volatile __near unsigned short *)0x62A)
#define C0MIDH02     (*(volatile __near unsigned short *)0x62C)
#define C0MCTRL02    (*(volatile __near unsigned short *)0x62E)
#define C0MDB0103    (*(volatile __near unsigned short *)0x630)
#define C0MDB003     (*(volatile __near unsigned char  *)0x630)
#define C0MDB103     (*(volatile __near unsigned char  *)0x631)
#define C0MDB2303    (*(volatile __near unsigned short *)0x632)
#define C0MDB203     (*(volatile __near unsigned char  *)0x632)
#define C0MDB303     (*(volatile __near unsigned char  *)0x633)
#define C0MDB4503    (*(volatile __near unsigned short *)0x634)
#define C0MDB403     (*(volatile __near unsigned char  *)0x634)
#define C0MDB503     (*(volatile __near unsigned char  *)0x635)
#define C0MDB6703    (*(volatile __near unsigned short *)0x636)
#define C0MDB603     (*(volatile __near unsigned char  *)0x636)
#define C0MDB703     (*(volatile __near unsigned char  *)0x637)
#define C0MDLC03     (*(volatile __near unsigned char  *)0x638)
#define C0MCONF03    (*(volatile __near unsigned char  *)0x639)
#define C0MIDL03     (*(volatile __near unsigned short *)0x63A)
#define C0MIDH03     (*(volatile __near unsigned short *)0x63C)
#define C0MCTRL03    (*(volatile __near unsigned short *)0x63E)
#define C0MDB0104    (*(volatile __near unsigned short *)0x640)
#define C0MDB004     (*(volatile __near unsigned char  *)0x640)
#define C0MDB104     (*(volatile __near unsigned char  *)0x641)
#define C0MDB2304    (*(volatile __near unsigned short *)0x642)
#define C0MDB204     (*(volatile __near unsigned char  *)0x642)
#define C0MDB304     (*(volatile __near unsigned char  *)0x643)
#define C0MDB4504    (*(volatile __near unsigned short *)0x644)
#define C0MDB404     (*(volatile __near unsigned char  *)0x644)
#define C0MDB504     (*(volatile __near unsigned char  *)0x645)
#define C0MDB6704    (*(volatile __near unsigned short *)0x646)
#define C0MDB604     (*(volatile __near unsigned char  *)0x646)
#define C0MDB704     (*(volatile __near unsigned char  *)0x647)
#define C0MDLC04     (*(volatile __near unsigned char  *)0x648)
#define C0MCONF04    (*(volatile __near unsigned char  *)0x649)
#define C0MIDL04     (*(volatile __near unsigned short *)0x64A)
#define C0MIDH04     (*(volatile __near unsigned short *)0x64C)
#define C0MCTRL04    (*(volatile __near unsigned short *)0x64E)
#define C0MDB0105    (*(volatile __near unsigned short *)0x650)
#define C0MDB005     (*(volatile __near unsigned char  *)0x650)
#define C0MDB105     (*(volatile __near unsigned char  *)0x651)
#define C0MDB2305    (*(volatile __near unsigned short *)0x652)
#define C0MDB205     (*(volatile __near unsigned char  *)0x652)
#define C0MDB305     (*(volatile __near unsigned char  *)0x653)
#define C0MDB4505    (*(volatile __near unsigned short *)0x654)
#define C0MDB405     (*(volatile __near unsigned char  *)0x654)
#define C0MDB505     (*(volatile __near unsigned char  *)0x655)
#define C0MDB6705    (*(volatile __near unsigned short *)0x656)
#define C0MDB605     (*(volatile __near unsigned char  *)0x656)
#define C0MDB705     (*(volatile __near unsigned char  *)0x657)
#define C0MDLC05     (*(volatile __near unsigned char  *)0x658)
#define C0MCONF05    (*(volatile __near unsigned char  *)0x659)
#define C0MIDL05     (*(volatile __near unsigned short *)0x65A)
#define C0MIDH05     (*(volatile __near unsigned short *)0x65C)
#define C0MCTRL05    (*(volatile __near unsigned short *)0x65E)
#define C0MDB0106    (*(volatile __near unsigned short *)0x660)
#define C0MDB006     (*(volatile __near unsigned char  *)0x660)
#define C0MDB106     (*(volatile __near unsigned char  *)0x661)
#define C0MDB2306    (*(volatile __near unsigned short *)0x662)
#define C0MDB206     (*(volatile __near unsigned char  *)0x662)
#define C0MDB306     (*(volatile __near unsigned char  *)0x663)
#define C0MDB4506    (*(volatile __near unsigned short *)0x664)
#define C0MDB406     (*(volatile __near unsigned char  *)0x664)
#define C0MDB506     (*(volatile __near unsigned char  *)0x665)
#define C0MDB6706    (*(volatile __near unsigned short *)0x666)
#define C0MDB606     (*(volatile __near unsigned char  *)0x666)
#define C0MDB706     (*(volatile __near unsigned char  *)0x667)
#define C0MDLC06     (*(volatile __near unsigned char  *)0x668)
#define C0MCONF06    (*(volatile __near unsigned char  *)0x669)
#define C0MIDL06     (*(volatile __near unsigned short *)0x66A)
#define C0MIDH06     (*(volatile __near unsigned short *)0x66C)
#define C0MCTRL06    (*(volatile __near unsigned short *)0x66E)
#define C0MDB0107    (*(volatile __near unsigned short *)0x670)
#define C0MDB007     (*(volatile __near unsigned char  *)0x670)
#define C0MDB107     (*(volatile __near unsigned char  *)0x671)
#define C0MDB2307    (*(volatile __near unsigned short *)0x672)
#define C0MDB207     (*(volatile __near unsigned char  *)0x672)
#define C0MDB307     (*(volatile __near unsigned char  *)0x673)
#define C0MDB4507    (*(volatile __near unsigned short *)0x674)
#define C0MDB407     (*(volatile __near unsigned char  *)0x674)
#define C0MDB507     (*(volatile __near unsigned char  *)0x675)
#define C0MDB6707    (*(volatile __near unsigned short *)0x676)
#define C0MDB607     (*(volatile __near unsigned char  *)0x676)
#define C0MDB707     (*(volatile __near unsigned char  *)0x677)
#define C0MDLC07     (*(volatile __near unsigned char  *)0x678)
#define C0MCONF07    (*(volatile __near unsigned char  *)0x679)
#define C0MIDL07     (*(volatile __near unsigned short *)0x67A)
#define C0MIDH07     (*(volatile __near unsigned short *)0x67C)
#define C0MCTRL07    (*(volatile __near unsigned short *)0x67E)
#define C0MDB0108    (*(volatile __near unsigned short *)0x680)
#define C0MDB008     (*(volatile __near unsigned char  *)0x680)
#define C0MDB108     (*(volatile __near unsigned char  *)0x681)
#define C0MDB2308    (*(volatile __near unsigned short *)0x682)
#define C0MDB208     (*(volatile __near unsigned char  *)0x682)
#define C0MDB308     (*(volatile __near unsigned char  *)0x683)
#define C0MDB4508    (*(volatile __near unsigned short *)0x684)
#define C0MDB408     (*(volatile __near unsigned char  *)0x684)
#define C0MDB508     (*(volatile __near unsigned char  *)0x685)
#define C0MDB6708    (*(volatile __near unsigned short *)0x686)
#define C0MDB608     (*(volatile __near unsigned char  *)0x686)
#define C0MDB708     (*(volatile __near unsigned char  *)0x687)
#define C0MDLC08     (*(volatile __near unsigned char  *)0x688)
#define C0MCONF08    (*(volatile __near unsigned char  *)0x689)
#define C0MIDL08     (*(volatile __near unsigned short *)0x68A)
#define C0MIDH08     (*(volatile __near unsigned short *)0x68C)
#define C0MCTRL08    (*(volatile __near unsigned short *)0x68E)
#define C0MDB0109    (*(volatile __near unsigned short *)0x690)
#define C0MDB009     (*(volatile __near unsigned char  *)0x690)
#define C0MDB109     (*(volatile __near unsigned char  *)0x691)
#define C0MDB2309    (*(volatile __near unsigned short *)0x692)
#define C0MDB209     (*(volatile __near unsigned char  *)0x692)
#define C0MDB309     (*(volatile __near unsigned char  *)0x693)
#define C0MDB4509    (*(volatile __near unsigned short *)0x694)
#define C0MDB409     (*(volatile __near unsigned char  *)0x694)
#define C0MDB509     (*(volatile __near unsigned char  *)0x695)
#define C0MDB6709    (*(volatile __near unsigned short *)0x696)
#define C0MDB609     (*(volatile __near unsigned char  *)0x696)
#define C0MDB709     (*(volatile __near unsigned char  *)0x697)
#define C0MDLC09     (*(volatile __near unsigned char  *)0x698)
#define C0MCONF09    (*(volatile __near unsigned char  *)0x699)
#define C0MIDL09     (*(volatile __near unsigned short *)0x69A)
#define C0MIDH09     (*(volatile __near unsigned short *)0x69C)
#define C0MCTRL09    (*(volatile __near unsigned short *)0x69E)
#define C0MDB0110    (*(volatile __near unsigned short *)0x6A0)
#define C0MDB010     (*(volatile __near unsigned char  *)0x6A0)
#define C0MDB110     (*(volatile __near unsigned char  *)0x6A1)
#define C0MDB2310    (*(volatile __near unsigned short *)0x6A2)
#define C0MDB210     (*(volatile __near unsigned char  *)0x6A2)
#define C0MDB310     (*(volatile __near unsigned char  *)0x6A3)
#define C0MDB4510    (*(volatile __near unsigned short *)0x6A4)
#define C0MDB410     (*(volatile __near unsigned char  *)0x6A4)
#define C0MDB510     (*(volatile __near unsigned char  *)0x6A5)
#define C0MDB6710    (*(volatile __near unsigned short *)0x6A6)
#define C0MDB610     (*(volatile __near unsigned char  *)0x6A6)
#define C0MDB710     (*(volatile __near unsigned char  *)0x6A7)
#define C0MDLC10     (*(volatile __near unsigned char  *)0x6A8)
#define C0MCONF10    (*(volatile __near unsigned char  *)0x6A9)
#define C0MIDL10     (*(volatile __near unsigned short *)0x6AA)
#define C0MIDH10     (*(volatile __near unsigned short *)0x6AC)
#define C0MCTRL10    (*(volatile __near unsigned short *)0x6AE)
#define C0MDB0111    (*(volatile __near unsigned short *)0x6B0)
#define C0MDB011     (*(volatile __near unsigned char  *)0x6B0)
#define C0MDB111     (*(volatile __near unsigned char  *)0x6B1)
#define C0MDB2311    (*(volatile __near unsigned short *)0x6B2)
#define C0MDB211     (*(volatile __near unsigned char  *)0x6B2)
#define C0MDB311     (*(volatile __near unsigned char  *)0x6B3)
#define C0MDB4511    (*(volatile __near unsigned short *)0x6B4)
#define C0MDB411     (*(volatile __near unsigned char  *)0x6B4)
#define C0MDB511     (*(volatile __near unsigned char  *)0x6B5)
#define C0MDB6711    (*(volatile __near unsigned short *)0x6B6)
#define C0MDB611     (*(volatile __near unsigned char  *)0x6B6)
#define C0MDB711     (*(volatile __near unsigned char  *)0x6B7)
#define C0MDLC11     (*(volatile __near unsigned char  *)0x6B8)
#define C0MCONF11    (*(volatile __near unsigned char  *)0x6B9)
#define C0MIDL11     (*(volatile __near unsigned short *)0x6BA)
#define C0MIDH11     (*(volatile __near unsigned short *)0x6BC)
#define C0MCTRL11    (*(volatile __near unsigned short *)0x6BE)
#define C0MDB0112    (*(volatile __near unsigned short *)0x6C0)
#define C0MDB012     (*(volatile __near unsigned char  *)0x6C0)
#define C0MDB112     (*(volatile __near unsigned char  *)0x6C1)
#define C0MDB2312    (*(volatile __near unsigned short *)0x6C2)
#define C0MDB212     (*(volatile __near unsigned char  *)0x6C2)
#define C0MDB312     (*(volatile __near unsigned char  *)0x6C3)
#define C0MDB4512    (*(volatile __near unsigned short *)0x6C4)
#define C0MDB412     (*(volatile __near unsigned char  *)0x6C4)
#define C0MDB512     (*(volatile __near unsigned char  *)0x6C5)
#define C0MDB6712    (*(volatile __near unsigned short *)0x6C6)
#define C0MDB612     (*(volatile __near unsigned char  *)0x6C6)
#define C0MDB712     (*(volatile __near unsigned char  *)0x6C7)
#define C0MDLC12     (*(volatile __near unsigned char  *)0x6C8)
#define C0MCONF12    (*(volatile __near unsigned char  *)0x6C9)
#define C0MIDL12     (*(volatile __near unsigned short *)0x6CA)
#define C0MIDH12     (*(volatile __near unsigned short *)0x6CC)
#define C0MCTRL12    (*(volatile __near unsigned short *)0x6CE)
#define C0MDB0113    (*(volatile __near unsigned short *)0x6D0)
#define C0MDB013     (*(volatile __near unsigned char  *)0x6D0)
#define C0MDB113     (*(volatile __near unsigned char  *)0x6D1)
#define C0MDB2313    (*(volatile __near unsigned short *)0x6D2)
#define C0MDB213     (*(volatile __near unsigned char  *)0x6D2)
#define C0MDB313     (*(volatile __near unsigned char  *)0x6D3)
#define C0MDB4513    (*(volatile __near unsigned short *)0x6D4)
#define C0MDB413     (*(volatile __near unsigned char  *)0x6D4)
#define C0MDB513     (*(volatile __near unsigned char  *)0x6D5)
#define C0MDB6713    (*(volatile __near unsigned short *)0x6D6)
#define C0MDB613     (*(volatile __near unsigned char  *)0x6D6)
#define C0MDB713     (*(volatile __near unsigned char  *)0x6D7)
#define C0MDLC13     (*(volatile __near unsigned char  *)0x6D8)
#define C0MCONF13    (*(volatile __near unsigned char  *)0x6D9)
#define C0MIDL13     (*(volatile __near unsigned short *)0x6DA)
#define C0MIDH13     (*(volatile __near unsigned short *)0x6DC)
#define C0MCTRL13    (*(volatile __near unsigned short *)0x6DE)
#define C0MDB0114    (*(volatile __near unsigned short *)0x6E0)
#define C0MDB014     (*(volatile __near unsigned char  *)0x6E0)
#define C0MDB114     (*(volatile __near unsigned char  *)0x6E1)
#define C0MDB2314    (*(volatile __near unsigned short *)0x6E2)
#define C0MDB214     (*(volatile __near unsigned char  *)0x6E2)
#define C0MDB314     (*(volatile __near unsigned char  *)0x6E3)
#define C0MDB4514    (*(volatile __near unsigned short *)0x6E4)
#define C0MDB414     (*(volatile __near unsigned char  *)0x6E4)
#define C0MDB514     (*(volatile __near unsigned char  *)0x6E5)
#define C0MDB6714    (*(volatile __near unsigned short *)0x6E6)
#define C0MDB614     (*(volatile __near unsigned char  *)0x6E6)
#define C0MDB714     (*(volatile __near unsigned char  *)0x6E7)
#define C0MDLC14     (*(volatile __near unsigned char  *)0x6E8)
#define C0MCONF14    (*(volatile __near unsigned char  *)0x6E9)
#define C0MIDL14     (*(volatile __near unsigned short *)0x6EA)
#define C0MIDH14     (*(volatile __near unsigned short *)0x6EC)
#define C0MCTRL14    (*(volatile __near unsigned short *)0x6EE)
#define C0MDB0115    (*(volatile __near unsigned short *)0x6F0)
#define C0MDB015     (*(volatile __near unsigned char  *)0x6F0)
#define C0MDB115     (*(volatile __near unsigned char  *)0x6F1)
#define C0MDB2315    (*(volatile __near unsigned short *)0x6F2)
#define C0MDB215     (*(volatile __near unsigned char  *)0x6F2)
#define C0MDB315     (*(volatile __near unsigned char  *)0x6F3)
#define C0MDB4515    (*(volatile __near unsigned short *)0x6F4)
#define C0MDB415     (*(volatile __near unsigned char  *)0x6F4)
#define C0MDB515     (*(volatile __near unsigned char  *)0x6F5)
#define C0MDB6715    (*(volatile __near unsigned short *)0x6F6)
#define C0MDB615     (*(volatile __near unsigned char  *)0x6F6)
#define C0MDB715     (*(volatile __near unsigned char  *)0x6F7)
#define C0MDLC15     (*(volatile __near unsigned char  *)0x6F8)
#define C0MCONF15    (*(volatile __near unsigned char  *)0x6F9)
#define C0MIDL15     (*(volatile __near unsigned short *)0x6FA)
#define C0MIDH15     (*(volatile __near unsigned short *)0x6FC)
#define C0MCTRL15    (*(volatile __near unsigned short *)0x6FE)
#define P0           (*(volatile __near unsigned char  *)0xFF00)
#define P0_bit       (*(volatile __near __bitf_T *)0xFF00)
#define P1           (*(volatile __near unsigned char  *)0xFF01)
#define P1_bit       (*(volatile __near __bitf_T *)0xFF01)
#define P2           (*(volatile __near unsigned char  *)0xFF02)
#define P2_bit       (*(volatile __near __bitf_T *)0xFF02)
#define P3           (*(volatile __near unsigned char  *)0xFF03)
#define P3_bit       (*(volatile __near __bitf_T *)0xFF03)
#define P4           (*(volatile __near unsigned char  *)0xFF04)
#define P4_bit       (*(volatile __near __bitf_T *)0xFF04)
#define P5           (*(volatile __near unsigned char  *)0xFF05)
#define P5_bit       (*(volatile __near __bitf_T *)0xFF05)
#define P6           (*(volatile __near unsigned char  *)0xFF06)
#define P6_bit       (*(volatile __near __bitf_T *)0xFF06)
#define P7           (*(volatile __near unsigned char  *)0xFF07)
#define P7_bit       (*(volatile __near __bitf_T *)0xFF07)
#define P8           (*(volatile __near unsigned char  *)0xFF08)
#define P8_bit       (*(volatile __near __bitf_T *)0xFF08)
#define P9           (*(volatile __near unsigned char  *)0xFF09)
#define P9_bit       (*(volatile __near __bitf_T *)0xFF09)
#define P12          (*(volatile __near unsigned char  *)0xFF0C)
#define P12_bit      (*(volatile __near __bitf_T *)0xFF0C)
#define P13          (*(volatile __near unsigned char  *)0xFF0D)
#define P13_bit      (*(volatile __near __bitf_T *)0xFF0D)
#define P14          (*(volatile __near unsigned char  *)0xFF0E)
#define P14_bit      (*(volatile __near __bitf_T *)0xFF0E)
#define P15          (*(volatile __near unsigned char  *)0xFF0F)
#define P15_bit      (*(volatile __near __bitf_T *)0xFF0F)
#define SDR00        (*(volatile __near unsigned short *)0xFF10)
#define SDR00L       (*(volatile __near unsigned char  *)0xFF10)
#define SDR01        (*(volatile __near unsigned short *)0xFF12)
#define SDR01L       (*(volatile __near unsigned char  *)0xFF12)
#define SDR10        (*(volatile __near unsigned short *)0xFF14)
#define SDR10L       (*(volatile __near unsigned char  *)0xFF14)
#define SDR11        (*(volatile __near unsigned short *)0xFF16)
#define SDR11L       (*(volatile __near unsigned char  *)0xFF16)
#define TDR00        (*(volatile __near unsigned short *)0xFF18)
#define TDR01        (*(volatile __near unsigned short *)0xFF1A)
#define ADCR         (*(volatile __near unsigned short *)0xFF1E)
#define ADCRH        (*(volatile __near unsigned char  *)0xFF1F)
#define PM0          (*(volatile __near unsigned char  *)0xFF20)
#define PM0_bit      (*(volatile __near __bitf_T *)0xFF20)
#define PM1          (*(volatile __near unsigned char  *)0xFF21)
#define PM1_bit      (*(volatile __near __bitf_T *)0xFF21)
#define PM2          (*(volatile __near unsigned char  *)0xFF22)
#define PM2_bit      (*(volatile __near __bitf_T *)0xFF22)
#define PM3          (*(volatile __near unsigned char  *)0xFF23)
#define PM3_bit      (*(volatile __near __bitf_T *)0xFF23)
#define PM4          (*(volatile __near unsigned char  *)0xFF24)
#define PM4_bit      (*(volatile __near __bitf_T *)0xFF24)
#define PM5          (*(volatile __near unsigned char  *)0xFF25)
#define PM5_bit      (*(volatile __near __bitf_T *)0xFF25)
#define PM6          (*(volatile __near unsigned char  *)0xFF26)
#define PM6_bit      (*(volatile __near __bitf_T *)0xFF26)
#define PM7          (*(volatile __near unsigned char  *)0xFF27)
#define PM7_bit      (*(volatile __near __bitf_T *)0xFF27)
#define PM8          (*(volatile __near unsigned char  *)0xFF28)
#define PM8_bit      (*(volatile __near __bitf_T *)0xFF28)
#define PM9          (*(volatile __near unsigned char  *)0xFF29)
