Nadir-KT/Programming-Languages/DSA/DFL/11-CSP_CCRL_R5F104PJ_DataFlash_v3/R5F10DPL.001/iodefine.h
#define PM9_bit      (*(volatile __near __bitf_T *)0xFF29)
#define PM13         (*(volatile __near unsigned char  *)0xFF2D)
#define PM13_bit     (*(volatile __near __bitf_T *)0xFF2D)
#define PM14         (*(volatile __near unsigned char  *)0xFF2E)
#define PM14_bit     (*(volatile __near __bitf_T *)0xFF2E)
#define PM15         (*(volatile __near unsigned char  *)0xFF2F)
#define PM15_bit     (*(volatile __near __bitf_T *)0xFF2F)
#define ADM0         (*(volatile __near unsigned char  *)0xFF30)
#define ADM0_bit     (*(volatile __near __bitf_T *)0xFF30)
#define ADCE         (((volatile __near __bitf_T *)0xFF30)->no0)
#define LV0          (((volatile __near __bitf_T *)0xFF30)->no1)
#define LV1          (((volatile __near __bitf_T *)0xFF30)->no2)
#define FR0          (((volatile __near __bitf_T *)0xFF30)->no3)
#define FR1          (((volatile __near __bitf_T *)0xFF30)->no4)
#define FR2          (((volatile __near __bitf_T *)0xFF30)->no5)
#define ADMD         (((volatile __near __bitf_T *)0xFF30)->no6)
#define ADCS         (((volatile __near __bitf_T *)0xFF30)->no7)
#define ADS          (*(volatile __near unsigned char  *)0xFF31)
#define ADS_bit      (*(volatile __near __bitf_T *)0xFF31)
#define ADM1         (*(volatile __near unsigned char  *)0xFF32)
#define ADM1_bit     (*(volatile __near __bitf_T *)0xFF32)
#define ADTRS0       (((volatile __near __bitf_T *)0xFF32)->no0)
#define ADTRS1       (((volatile __near __bitf_T *)0xFF32)->no1)
#define ADSCM        (((volatile __near __bitf_T *)0xFF32)->no5)
#define ADTMD0       (((volatile __near __bitf_T *)0xFF32)->no6)
#define ADTMD1       (((volatile __near __bitf_T *)0xFF32)->no7)
#define SUBCUDW      (*(volatile __near unsigned short *)0xFF34)
#define RTCSEL       (*(volatile __near unsigned char  *)0xFF36)
#define RTCSEL_bit   (*(volatile __near __bitf_T *)0xFF36)
#define RTCTIS00     (((volatile __near __bitf_T *)0xFF36)->no0)
#define RTCTIS01     (((volatile __near __bitf_T *)0xFF36)->no1)
#define RTCTIS10     (((volatile __near __bitf_T *)0xFF36)->no2)
#define RTCTIS11     (((volatile __near __bitf_T *)0xFF36)->no3)
#define RTCOSEL0     (((volatile __near __bitf_T *)0xFF36)->no6)
#define RTCOSEL1     (((volatile __near __bitf_T *)0xFF36)->no7)
#define SMPC         (*(volatile __near unsigned char  *)0xFF37)
#define SMPC_bit     (*(volatile __near __bitf_T *)0xFF37)
#define EN1          (((volatile __near __bitf_T *)0xFF37)->no0)
#define EN2          (((volatile __near __bitf_T *)0xFF37)->no1)
#define EN3          (((volatile __near __bitf_T *)0xFF37)->no2)
#define EN4          (((volatile __near __bitf_T *)0xFF37)->no3)
#define MOD1         (((volatile __near __bitf_T *)0xFF37)->no4)
#define MOD2         (((volatile __near __bitf_T *)0xFF37)->no5)
#define MOD3         (((volatile __near __bitf_T *)0xFF37)->no6)
#define MOD4         (((volatile __near __bitf_T *)0xFF37)->no7)
#define EGP0         (*(volatile __near unsigned char  *)0xFF38)
#define EGP0_bit     (*(volatile __near __bitf_T *)0xFF38)
#define EGN0         (*(volatile __near unsigned char  *)0xFF39)
#define EGN0_bit     (*(volatile __near __bitf_T *)0xFF39)
#define STSEL0       (*(volatile __near unsigned char  *)0xFF3C)
#define STSEL0_bit   (*(volatile __near __bitf_T *)0xFF3C)
#define SUARTF0      (((volatile __near __bitf_T *)0xFF3C)->no0)
#define SUARTF1      (((volatile __near __bitf_T *)0xFF3C)->no1)
#define SCSI000      (((volatile __near __bitf_T *)0xFF3C)->no2)
#define SCSI001      (((volatile __near __bitf_T *)0xFF3C)->no3)
#define SCSI010      (((volatile __near __bitf_T *)0xFF3C)->no4)
#define SCSI100      (((volatile __near __bitf_T *)0xFF3C)->no6)
#define STSEL1       (*(volatile __near unsigned char  *)0xFF3D)
#define STSEL1_bit   (*(volatile __near __bitf_T *)0xFF3D)
#define TMCAN0       (((volatile __near __bitf_T *)0xFF3D)->no0)
#define TMCAN1       (((volatile __near __bitf_T *)0xFF3D)->no1)
#define SCAN0        (((volatile __near __bitf_T *)0xFF3D)->no2)
#define SCAN1        (((volatile __near __bitf_T *)0xFF3D)->no3)
#define SIIC0        (((volatile __near __bitf_T *)0xFF3D)->no6)
#define SIIC1        (((volatile __near __bitf_T *)0xFF3D)->no7)
#define TISELSE      (*(volatile __near unsigned char  *)0xFF3E)
#define TISELSE_bit  (*(volatile __near __bitf_T *)0xFF3E)
#define TI05SEL0     (((volatile __near __bitf_T *)0xFF3E)->no0)
#define TI05SEL1     (((volatile __near __bitf_T *)0xFF3E)->no1)
#define TOTICON0     (((volatile __near __bitf_T *)0xFF3E)->no6)
#define TOTICON1     (((volatile __near __bitf_T *)0xFF3E)->no7)
#define SGSEL        (*(volatile __near unsigned char  *)0xFF3F)
#define SGSEL_bit    (*(volatile __near __bitf_T *)0xFF3F)
#define PCLSEL       (((volatile __near __bitf_T *)0xFF3F)->no3)
#define LCDMD        (*(volatile __near unsigned char  *)0xFF40)
#define LCDMD_bit    (*(volatile __near __bitf_T *)0xFF40)
#define MDSET0       (((volatile __near __bitf_T *)0xFF40)->no4)
#define MDSET1       (((volatile __near __bitf_T *)0xFF40)->no5)
#define LCDM         (*(volatile __near unsigned char  *)0xFF41)
#define LCDM_bit     (*(volatile __near __bitf_T *)0xFF41)
#define SCOC         (((volatile __near __bitf_T *)0xFF41)->no6)
#define LCDON        (((volatile __near __bitf_T *)0xFF41)->no7)
#define LCDC0        (*(volatile __near unsigned char  *)0xFF42)
#define LCDC0_bit    (*(volatile __near __bitf_T *)0xFF42)
#define UF0TX        (*(volatile __near unsigned short *)0xFF48)
#define UF0TXB       (*(volatile __near unsigned char  *)0xFF48)
#define UF0RX        (*(volatile __near unsigned short *)0xFF4A)
#define UF0RXB       (*(volatile __near unsigned char  *)0xFF4A)
#define UF1TX        (*(volatile __near unsigned short *)0xFF4C)
#define UF1TXB       (*(volatile __near unsigned char  *)0xFF4C)
#define UF1RX        (*(volatile __near unsigned short *)0xFF4E)
#define UF1RXB       (*(volatile __near unsigned char  *)0xFF4E)
#define ITMC         (*(volatile __near unsigned short *)0xFF50)
#define SEC          (*(volatile __near unsigned char  *)0xFF52)
#define MIN          (*(volatile __near unsigned char  *)0xFF53)
#define HOUR         (*(volatile __near unsigned char  *)0xFF54)
#define WEEK         (*(volatile __near unsigned char  *)0xFF55)
#define DAY          (*(volatile __near unsigned char  *)0xFF56)
#define MONTH        (*(volatile __near unsigned char  *)0xFF57)
#define YEAR         (*(volatile __near unsigned char  *)0xFF58)
#define SUBCUD       (*(volatile __near unsigned char  *)0xFF59)
#define ALARMWM      (*(volatile __near unsigned char  *)0xFF5A)
#define ALARMWH      (*(volatile __near unsigned char  *)0xFF5B)
#define ALARMWW      (*(volatile __near unsigned char  *)0xFF5C)
#define RTCC0        (*(volatile __near unsigned char  *)0xFF5D)
#define RTCC0_bit    (*(volatile __near __bitf_T *)0xFF5D)
#define CT0          (((volatile __near __bitf_T *)0xFF5D)->no0)
#define CT1          (((volatile __near __bitf_T *)0xFF5D)->no1)
#define CT2          (((volatile __near __bitf_T *)0xFF5D)->no2)
#define AMPM         (((volatile __near __bitf_T *)0xFF5D)->no3)
#define RCLOE1       (((volatile __near __bitf_T *)0xFF5D)->no5)
#define RTCE         (((volatile __near __bitf_T *)0xFF5D)->no7)
#define RTCC1        (*(volatile __near unsigned char  *)0xFF5E)
#define RTCC1_bit    (*(volatile __near __bitf_T *)0xFF5E)
#define RWAIT        (((volatile __near __bitf_T *)0xFF5E)->no0)
#define RWST         (((volatile __near __bitf_T *)0xFF5E)->no1)
#define RIFG         (((volatile __near __bitf_T *)0xFF5E)->no3)
#define WAFG         (((volatile __near __bitf_T *)0xFF5E)->no4)
#define WALIE        (((volatile __near __bitf_T *)0xFF5E)->no6)
#define WALE         (((volatile __near __bitf_T *)0xFF5E)->no7)
#define TDR02        (*(volatile __near unsigned short *)0xFF64)
#define TDR03        (*(volatile __near unsigned short *)0xFF66)
#define TDR04        (*(volatile __near unsigned short *)0xFF68)
#define TDR05        (*(volatile __near unsigned short *)0xFF6A)
#define TDR06        (*(volatile __near unsigned short *)0xFF6C)
#define TDR07        (*(volatile __near unsigned short *)0xFF6E)
#define TDR10        (*(volatile __near unsigned short *)0xFF70)
#define TDR11        (*(volatile __near unsigned short *)0xFF72)
#define TDR12        (*(volatile __near unsigned short *)0xFF74)
#define TDR13        (*(volatile __near unsigned short *)0xFF76)
#define TDR14        (*(volatile __near unsigned short *)0xFF78)
#define TDR15        (*(volatile __near unsigned short *)0xFF7A)
#define TDR16        (*(volatile __near unsigned short *)0xFF7C)
#define TDR17        (*(volatile __near unsigned short *)0xFF7E)
#define TDR20        (*(volatile __near unsigned short *)0xFF90)
#define TDR21        (*(volatile __near unsigned short *)0xFF92)
#define TDR22        (*(volatile __near unsigned short *)0xFF94)
#define TDR23        (*(volatile __near unsigned short *)0xFF96)
#define TDR24        (*(volatile __near unsigned short *)0xFF98)
#define TDR25        (*(volatile __near unsigned short *)0xFF9A)
#define TDR26        (*(volatile __near unsigned short *)0xFF9C)
#define TDR27        (*(volatile __near unsigned short *)0xFF9E)
#define CMC          (*(volatile __near unsigned char  *)0xFFA0)
#define CSC          (*(volatile __near unsigned char  *)0xFFA1)
#define CSC_bit      (*(volatile __near __bitf_T *)0xFFA1)
#define HIOSTOP      (((volatile __near __bitf_T *)0xFFA1)->no0)
#define XTSTOP       (((volatile __near __bitf_T *)0xFFA1)->no6)
#define MSTOP        (((volatile __near __bitf_T *)0xFFA1)->no7)
#define OSTC         (*(volatile __near unsigned char  *)0xFFA2)
#define OSTC_bit     (*(volatile __near __bitf_T *)0xFFA2)
#define MOST18       (((volatile __near __bitf_T *)0xFFA2)->no0)
#define MOST17       (((volatile __near __bitf_T *)0xFFA2)->no1)
#define MOST15       (((volatile __near __bitf_T *)0xFFA2)->no2)
#define MOST13       (((volatile __near __bitf_T *)0xFFA2)->no3)
#define MOST11       (((volatile __near __bitf_T *)0xFFA2)->no4)
#define MOST10       (((volatile __near __bitf_T *)0xFFA2)->no5)
#define MOST9        (((volatile __near __bitf_T *)0xFFA2)->no6)
#define MOST8        (((volatile __near __bitf_T *)0xFFA2)->no7)
#define OSTS         (*(volatile __near unsigned char  *)0xFFA3)
#define CKC          (*(volatile __near unsigned char  *)0xFFA4)
#define CKC_bit      (*(volatile __near __bitf_T *)0xFFA4)
#define MCM0         (((volatile __near __bitf_T *)0xFFA4)->no4)
#define MCS          (((volatile __near __bitf_T *)0xFFA4)->no5)
#define CSS          (((volatile __near __bitf_T *)0xFFA4)->no6)
#define CLS          (((volatile __near __bitf_T *)0xFFA4)->no7)
#define CKS0         (*(volatile __near unsigned char  *)0xFFA5)
#define CKS0_bit     (*(volatile __near __bitf_T *)0xFFA5)
#define CCS00        (((volatile __near __bitf_T *)0xFFA5)->no0)
#define CCS01        (((volatile __near __bitf_T *)0xFFA5)->no1)
#define CCS02        (((volatile __near __bitf_T *)0xFFA5)->no2)
#define CSEL0        (((volatile __near __bitf_T *)0xFFA5)->no3)
#define PCLOE0       (((volatile __near __bitf_T *)0xFFA5)->no7)
#define RESF         (*(volatile __near unsigned char  *)0xFFA8)
#define LVIM         (*(volatile __near unsigned char  *)0xFFA9)
#define LVIM_bit     (*(volatile __near __bitf_T *)0xFFA9)
#define LVIF         (((volatile __near __bitf_T *)0xFFA9)->no0)
#define LVIOMSK      (((volatile __near __bitf_T *)0xFFA9)->no1)
#define LVISEN       (((volatile __near __bitf_T *)0xFFA9)->no7)
#define LVIS         (*(volatile __near unsigned char  *)0xFFAA)
#define LVIS_bit     (*(volatile __near __bitf_T *)0xFFAA)
#define LVILV        (((volatile __near __bitf_T *)0xFFAA)->no0)
#define LVIMD        (((volatile __near __bitf_T *)0xFFAA)->no7)
#define WDTE         (*(volatile __near unsigned char  *)0xFFAB)
#define CRCIN        (*(volatile __near unsigned char  *)0xFFAC)
#define DSA0         (*(volatile __near unsigned char  *)0xFFB0)
#define DSA1         (*(volatile __near unsigned char  *)0xFFB1)
#define DRA0         (*(volatile __near unsigned short *)0xFFB2)
#define DRA0L        (*(volatile __near unsigned char  *)0xFFB2)
#define DRA0H        (*(volatile __near unsigned char  *)0xFFB3)
#define DRA1         (*(volatile __near unsigned short *)0xFFB4)
#define DRA1L        (*(volatile __near unsigned char  *)0xFFB4)
#define DRA1H        (*(volatile __near unsigned char  *)0xFFB5)
#define DBC0         (*(volatile __near unsigned short *)0xFFB6)
#define DBC0L        (*(volatile __near unsigned char  *)0xFFB6)
#define DBC0H        (*(volatile __near unsigned char  *)0xFFB7)
#define DBC1         (*(volatile __near unsigned short *)0xFFB8)
#define DBC1L        (*(volatile __near unsigned char  *)0xFFB8)
#define DBC1H        (*(volatile __near unsigned char  *)0xFFB9)
#define DMC0         (*(volatile __near unsigned char  *)0xFFBA)
#define DMC0_bit     (*(volatile __near __bitf_T *)0xFFBA)
#define IFC00        (((volatile __near __bitf_T *)0xFFBA)->no0)
#define IFC01        (((volatile __near __bitf_T *)0xFFBA)->no1)
#define IFC02        (((volatile __near __bitf_T *)0xFFBA)->no2)
#define IFC03        (((volatile __near __bitf_T *)0xFFBA)->no3)
#define DWAIT0       (((volatile __near __bitf_T *)0xFFBA)->no4)
#define DS0          (((volatile __near __bitf_T *)0xFFBA)->no5)
#define DRS0         (((volatile __near __bitf_T *)0xFFBA)->no6)
#define STG0         (((volatile __near __bitf_T *)0xFFBA)->no7)
#define DMC1         (*(volatile __near unsigned char  *)0xFFBB)
#define DMC1_bit     (*(volatile __near __bitf_T *)0xFFBB)
#define IFC10        (((volatile __near __bitf_T *)0xFFBB)->no0)
#define IFC11        (((volatile __near __bitf_T *)0xFFBB)->no1)
#define IFC12        (((volatile __near __bitf_T *)0xFFBB)->no2)
#define IFC13        (((volatile __near __bitf_T *)0xFFBB)->no3)
#define DWAIT1       (((volatile __near __bitf_T *)0xFFBB)->no4)
#define DS1          (((volatile __near __bitf_T *)0xFFBB)->no5)
#define DRS1         (((volatile __near __bitf_T *)0xFFBB)->no6)
#define STG1         (((volatile __near __bitf_T *)0xFFBB)->no7)
#define DRC0         (*(volatile __near unsigned char  *)0xFFBC)
#define DRC0_bit     (*(volatile __near __bitf_T *)0xFFBC)
#define DST0         (((volatile __near __bitf_T *)0xFFBC)->no0)
#define DEN0         (((volatile __near __bitf_T *)0xFFBC)->no7)
#define DRC1         (*(volatile __near unsigned char  *)0xFFBD)
#define DRC1_bit     (*(volatile __near __bitf_T *)0xFFBD)
#define DST1         (((volatile __near __bitf_T *)0xFFBD)->no0)
#define DEN1         (((volatile __near __bitf_T *)0xFFBD)->no7)
#define IF2          (*(volatile __near unsigned short *)0xFFD0)
#define IF2L         (*(volatile __near unsigned char  *)0xFFD0)
#define IF2L_bit     (*(volatile __near __bitf_T *)0xFFD0)
#define IF2H         (*(volatile __near unsigned char  *)0xFFD1)
#define IF2H_bit     (*(volatile __near __bitf_T *)0xFFD1)
#define TMIF05       (((volatile __near __bitf_T *)0xFFD0)->no0)
#define TMIF06       (((volatile __near __bitf_T *)0xFFD0)->no1)
#define TMIF07       (((volatile __near __bitf_T *)0xFFD0)->no2)
#define C1ERRIF      (((volatile __near __bitf_T *)0xFFD0)->no3)
#define C1WUPIF      (((volatile __near __bitf_T *)0xFFD0)->no4)
#define C0ERRIF      (((volatile __near __bitf_T *)0xFFD0)->no5)
#define C0WUPIF      (((volatile __near __bitf_T *)0xFFD0)->no6)
#define C0RECIF      (((volatile __near __bitf_T *)0xFFD0)->no7)
#define C0TRXIF      (((volatile __near __bitf_T *)0xFFD1)->no0)
#define TMIF10       (((volatile __near __bitf_T *)0xFFD1)->no1)
#define TMIF11       (((volatile __near __bitf_T *)0xFFD1)->no2)
#define TMIF12       (((volatile __near __bitf_T *)0xFFD1)->no3)
#define TMIF13       (((volatile __near __bitf_T *)0xFFD1)->no4)
#define MDIF         (((volatile __near __bitf_T *)0xFFD1)->no5)
#define C1RECIF      (((volatile __near __bitf_T *)0xFFD1)->no6)
#define FLIF         (((volatile __near __bitf_T *)0xFFD1)->no7)
#define IF3          (*(volatile __near unsigned short *)0xFFD2)
#define IF3L         (*(volatile __near unsigned char  *)0xFFD2)
#define IF3L_bit     (*(volatile __near __bitf_T *)0xFFD2)
#define IF3H         (*(volatile __near unsigned char  *)0xFFD3)
#define IF3H_bit     (*(volatile __near __bitf_T *)0xFFD3)
#define C1TRXIF      (((volatile __near __bitf_T *)0xFFD2)->no0)
#define TMIF14       (((volatile __near __bitf_T *)0xFFD2)->no1)
#define TMIF15       (((volatile __near __bitf_T *)0xFFD2)->no2)
#define TMIF16       (((volatile __near __bitf_T *)0xFFD2)->no3)
#define TMIF17       (((volatile __near __bitf_T *)0xFFD2)->no4)
#define TMIF20       (((volatile __near __bitf_T *)0xFFD2)->no5)
#define TMIF21       (((volatile __near __bitf_T *)0xFFD2)->no6)
#define TMIF22       (((volatile __near __bitf_T *)0xFFD2)->no7)
#define TMIF23       (((volatile __near __bitf_T *)0xFFD3)->no0)
#define TMIF24       (((volatile __near __bitf_T *)0xFFD3)->no1)
#define TMIF26       (((volatile __near __bitf_T *)0xFFD3)->no2)
#define DMAIF2       (((volatile __near __bitf_T *)0xFFD3)->no3)
#define DMAIF3       (((volatile __near __bitf_T *)0xFFD3)->no4)
#define MK2          (*(volatile __near unsigned short *)0xFFD4)
#define MK2L         (*(volatile __near unsigned char  *)0xFFD4)
#define MK2L_bit     (*(volatile __near __bitf_T *)0xFFD4)
#define MK2H         (*(volatile __near unsigned char  *)0xFFD5)
#define MK2H_bit     (*(volatile __near __bitf_T *)0xFFD5)
#define TMMK05       (((volatile __near __bitf_T *)0xFFD4)->no0)
#define TMMK06       (((volatile __near __bitf_T *)0xFFD4)->no1)
#define TMMK07       (((volatile __near __bitf_T *)0xFFD4)->no2)
#define C1ERRMK      (((volatile __near __bitf_T *)0xFFD4)->no3)
#define C1WUPMK      (((volatile __near __bitf_T *)0xFFD4)->no4)
#define C0ERRMK      (((volatile __near __bitf_T *)0xFFD4)->no5)
#define C0WUPMK      (((volatile __near __bitf_T *)0xFFD4)->no6)
#define C0RECMK      (((volatile __near __bitf_T *)0xFFD4)->no7)
#define C0TRXMK      (((volatile __near __bitf_T *)0xFFD5)->no0)
#define TMMK10       (((volatile __near __bitf_T *)0xFFD5)->no1)
#define TMMK11       (((volatile __near __bitf_T *)0xFFD5)->no2)
#define TMMK12       (((volatile __near __bitf_T *)0xFFD5)->no3)
#define TMMK13       (((volatile __near __bitf_T *)0xFFD5)->no4)
#define MDMK         (((volatile __near __bitf_T *)0xFFD5)->no5)
#define C1RECMK      (((volatile __near __bitf_T *)0xFFD5)->no6)
#define FLMK         (((volatile __near __bitf_T *)0xFFD5)->no7)
#define MK3          (*(volatile __near unsigned short *)0xFFD6)
#define MK3L         (*(volatile __near unsigned char  *)0xFFD6)
#define MK3L_bit     (*(volatile __near __bitf_T *)0xFFD6)
#define MK3H         (*(volatile __near unsigned char  *)0xFFD7)
#define MK3H_bit     (*(volatile __near __bitf_T *)0xFFD7)
#define C1TRXMK      (((volatile __near __bitf_T *)0xFFD6)->no0)
#define TMMK14       (((volatile __near __bitf_T *)0xFFD6)->no1)
#define TMMK15       (((volatile __near __bitf_T *)0xFFD6)->no2)
#define TMMK16       (((volatile __near __bitf_T *)0xFFD6)->no3)
#define TMMK17       (((volatile __near __bitf_T *)0xFFD6)->no4)
#define TMMK20       (((volatile __near __bitf_T *)0xFFD6)->no5)
#define TMMK21       (((volatile __near __bitf_T *)0xFFD6)->no6)
#define TMMK22       (((volatile __near __bitf_T *)0xFFD6)->no7)
#define TMMK23       (((volatile __near __bitf_T *)0xFFD7)->no0)
#define TMMK24       (((volatile __near __bitf_T *)0xFFD7)->no1)
#define TMMK26       (((volatile __near __bitf_T *)0xFFD7)->no2)
#define DMAMK2       (((volatile __near __bitf_T *)0xFFD7)->no3)
#define DMAMK3       (((volatile __near __bitf_T *)0xFFD7)->no4)
#define PR02         (*(volatile __near unsigned short *)0xFFD8)
#define PR02L        (*(volatile __near unsigned char  *)0xFFD8)
#define PR02L_bit    (*(volatile __near __bitf_T *)0xFFD8)
#define PR02H        (*(volatile __near unsigned char  *)0xFFD9)
#define PR02H_bit    (*(volatile __near __bitf_T *)0xFFD9)
#define TMPR005      (((volatile __near __bitf_T *)0xFFD8)->no0)
#define TMPR006      (((volatile __near __bitf_T *)0xFFD8)->no1)
#define TMPR007      (((volatile __near __bitf_T *)0xFFD8)->no2)
#define C1ERRPR0     (((volatile __near __bitf_T *)0xFFD8)->no3)
#define C1WUPPR0     (((volatile __near __bitf_T *)0xFFD8)->no4)
#define C0ERRPR0     (((volatile __near __bitf_T *)0xFFD8)->no5)
#define C0WUPPR0     (((volatile __near __bitf_T *)0xFFD8)->no6)
#define C0RECPR0     (((volatile __near __bitf_T *)0xFFD8)->no7)
#define C0TRXPR0     (((volatile __near __bitf_T *)0xFFD9)->no0)
#define TMPR010      (((volatile __near __bitf_T *)0xFFD9)->no1)
#define TMPR011      (((volatile __near __bitf_T *)0xFFD9)->no2)
#define TMPR012      (((volatile __near __bitf_T *)0xFFD9)->no3)
#define TMPR013      (((volatile __near __bitf_T *)0xFFD9)->no4)
#define MDPR0        (((volatile __near __bitf_T *)0xFFD9)->no5)
#define C1RECPR0     (((volatile __near __bitf_T *)0xFFD9)->no6)
#define FLPR0        (((volatile __near __bitf_T *)0xFFD9)->no7)
#define PR03         (*(volatile __near unsigned short *)0xFFDA)
#define PR03L        (*(volatile __near unsigned char  *)0xFFDA)
#define PR03L_bit    (*(volatile __near __bitf_T *)0xFFDA)
#define PR03H        (*(volatile __near unsigned char  *)0xFFDB)
#define PR03H_bit    (*(volatile __near __bitf_T *)0xFFDB)
#define C1TRXPR0     (((volatile __near __bitf_T *)0xFFDA)->no0)
#define TMPR014      (((volatile __near __bitf_T *)0xFFDA)->no1)
#define TMPR015      (((volatile __near __bitf_T *)0xFFDA)->no2)
#define TMPR016      (((volatile __near __bitf_T *)0xFFDA)->no3)
#define TMPR017      (((volatile __near __bitf_T *)0xFFDA)->no4)
#define TMPR020      (((volatile __near __bitf_T *)0xFFDA)->no5)
#define TMPR021      (((volatile __near __bitf_T *)0xFFDA)->no6)
#define TMPR022      (((volatile __near __bitf_T *)0xFFDA)->no7)
#define TMPR023      (((volatile __near __bitf_T *)0xFFDB)->no0)
#define TMPR024      (((volatile __near __bitf_T *)0xFFDB)->no1)
#define TMPR026      (((volatile __near __bitf_T *)0xFFDB)->no2)
#define DMAPR02      (((volatile __near __bitf_T *)0xFFDB)->no3)
#define DMAPR03      (((volatile __near __bitf_T *)0xFFDB)->no4)
#define PR12         (*(volatile __near unsigned short *)0xFFDC)
#define PR12L        (*(volatile __near unsigned char  *)0xFFDC)
#define PR12L_bit    (*(volatile __near __bitf_T *)0xFFDC)
#define PR12H        (*(volatile __near unsigned char  *)0xFFDD)
#define PR12H_bit    (*(volatile __near __bitf_T *)0xFFDD)
#define TMPR105      (((volatile __near __bitf_T *)0xFFDC)->no0)
#define TMPR106      (((volatile __near __bitf_T *)0xFFDC)->no1)
#define TMPR107      (((volatile __near __bitf_T *)0xFFDC)->no2)
#define C1ERRPR1     (((volatile __near __bitf_T *)0xFFDC)->no3)
#define C1WUPPR1     (((volatile __near __bitf_T *)0xFFDC)->no4)
#define C0ERRPR1     (((volatile __near __bitf_T *)0xFFDC)->no5)
#define C0WUPPR1     (((volatile __near __bitf_T *)0xFFDC)->no6)
#define C0RECPR1     (((volatile __near __bitf_T *)0xFFDC)->no7)
#define C0TRXPR1     (((volatile __near __bitf_T *)0xFFDD)->no0)
#define TMPR110      (((volatile __near __bitf_T *)0xFFDD)->no1)
#define TMPR111      (((volatile __near __bitf_T *)0xFFDD)->no2)
#define TMPR112      (((volatile __near __bitf_T *)0xFFDD)->no3)
#define TMPR113      (((volatile __near __bitf_T *)0xFFDD)->no4)
#define MDPR1        (((volatile __near __bitf_T *)0xFFDD)->no5)
#define C1RECPR1     (((volatile __near __bitf_T *)0xFFDD)->no6)
#define FLPR1        (((volatile __near __bitf_T *)0xFFDD)->no7)
#define PR13         (*(volatile __near unsigned short *)0xFFDE)
#define PR13L        (*(volatile __near unsigned char  *)0xFFDE)
#define PR13L_bit    (*(volatile __near __bitf_T *)0xFFDE)
#define PR13H        (*(volatile __near unsigned char  *)0xFFDF)
#define PR13H_bit    (*(volatile __near __bitf_T *)0xFFDF)
#define C1TRXPR1     (((volatile __near __bitf_T *)0xFFDE)->no0)
#define TMPR114      (((volatile __near __bitf_T *)0xFFDE)->no1)
#define TMPR115      (((volatile __near __bitf_T *)0xFFDE)->no2)
#define TMPR116      (((volatile __near __bitf_T *)0xFFDE)->no3)
