Nadir-KT/Programming-Languages/DSA/DFL/11-CSP_CCRL_R5F104PJ_DataFlash_v3/R5F10DPL.001/iodefine.h
#define TMPR117      (((volatile __near __bitf_T *)0xFFDE)->no4)
#define TMPR120      (((volatile __near __bitf_T *)0xFFDE)->no5)
#define TMPR121      (((volatile __near __bitf_T *)0xFFDE)->no6)
#define TMPR122      (((volatile __near __bitf_T *)0xFFDE)->no7)
#define TMPR123      (((volatile __near __bitf_T *)0xFFDF)->no0)
#define TMPR124      (((volatile __near __bitf_T *)0xFFDF)->no1)
#define TMPR126      (((volatile __near __bitf_T *)0xFFDF)->no2)
#define DMAPR12      (((volatile __near __bitf_T *)0xFFDF)->no3)
#define DMAPR13      (((volatile __near __bitf_T *)0xFFDF)->no4)
#define IF0          (*(volatile __near unsigned short *)0xFFE0)
#define IF0L         (*(volatile __near unsigned char  *)0xFFE0)
#define IF0L_bit     (*(volatile __near __bitf_T *)0xFFE0)
#define IF0H         (*(volatile __near unsigned char  *)0xFFE1)
#define IF0H_bit     (*(volatile __near __bitf_T *)0xFFE1)
#define WDTIIF       (((volatile __near __bitf_T *)0xFFE0)->no0)
#define LVIIF        (((volatile __near __bitf_T *)0xFFE0)->no1)
#define PIF0         (((volatile __near __bitf_T *)0xFFE0)->no2)
#define PIF1         (((volatile __near __bitf_T *)0xFFE0)->no3)
#define PIF2         (((volatile __near __bitf_T *)0xFFE0)->no4)
#define PIF3         (((volatile __near __bitf_T *)0xFFE0)->no5)
#define PIF4         (((volatile __near __bitf_T *)0xFFE0)->no6)
#define PIF5         (((volatile __near __bitf_T *)0xFFE0)->no7)
#define CLMIF        (((volatile __near __bitf_T *)0xFFE1)->no0)
#define CSIIF00      (((volatile __near __bitf_T *)0xFFE1)->no1)
#define CSIIF01      (((volatile __near __bitf_T *)0xFFE1)->no2)
#define DMAIF0       (((volatile __near __bitf_T *)0xFFE1)->no3)
#define DMAIF1       (((volatile __near __bitf_T *)0xFFE1)->no4)
#define RTCIF        (((volatile __near __bitf_T *)0xFFE1)->no5)
#define ITIF         (((volatile __near __bitf_T *)0xFFE1)->no6)
#define LTIF0        (((volatile __near __bitf_T *)0xFFE1)->no7)
#define IF1          (*(volatile __near unsigned short *)0xFFE2)
#define IF1L         (*(volatile __near unsigned char  *)0xFFE2)
#define IF1L_bit     (*(volatile __near __bitf_T *)0xFFE2)
#define IF1H         (*(volatile __near unsigned char  *)0xFFE3)
#define IF1H_bit     (*(volatile __near __bitf_T *)0xFFE3)
#define LRIF0        (((volatile __near __bitf_T *)0xFFE2)->no0)
#define LSIF0        (((volatile __near __bitf_T *)0xFFE2)->no1)
#define PIFLR0       (((volatile __near __bitf_T *)0xFFE2)->no2)
#define SGIF         (((volatile __near __bitf_T *)0xFFE2)->no3)
#define TMIF00       (((volatile __near __bitf_T *)0xFFE2)->no4)
#define TMIF01       (((volatile __near __bitf_T *)0xFFE2)->no5)
#define TMIF02       (((volatile __near __bitf_T *)0xFFE2)->no6)
#define TMIF03       (((volatile __near __bitf_T *)0xFFE2)->no7)
#define ADIF         (((volatile __near __bitf_T *)0xFFE3)->no0)
#define LTIF1        (((volatile __near __bitf_T *)0xFFE3)->no1)
#define LRIF1        (((volatile __near __bitf_T *)0xFFE3)->no2)
#define LSIF1        (((volatile __near __bitf_T *)0xFFE3)->no3)
#define PIFLR1       (((volatile __near __bitf_T *)0xFFE3)->no4)
#define CSIIF10      (((volatile __near __bitf_T *)0xFFE3)->no5)
#define IICIF11      (((volatile __near __bitf_T *)0xFFE3)->no6)
#define TMIF04       (((volatile __near __bitf_T *)0xFFE3)->no7)
#define MK0          (*(volatile __near unsigned short *)0xFFE4)
#define MK0L         (*(volatile __near unsigned char  *)0xFFE4)
#define MK0L_bit     (*(volatile __near __bitf_T *)0xFFE4)
#define MK0H         (*(volatile __near unsigned char  *)0xFFE5)
#define MK0H_bit     (*(volatile __near __bitf_T *)0xFFE5)
#define WDTIMK       (((volatile __near __bitf_T *)0xFFE4)->no0)
#define LVIMK        (((volatile __near __bitf_T *)0xFFE4)->no1)
#define PMK0         (((volatile __near __bitf_T *)0xFFE4)->no2)
#define PMK1         (((volatile __near __bitf_T *)0xFFE4)->no3)
#define PMK2         (((volatile __near __bitf_T *)0xFFE4)->no4)
#define PMK3         (((volatile __near __bitf_T *)0xFFE4)->no5)
#define PMK4         (((volatile __near __bitf_T *)0xFFE4)->no6)
#define PMK5         (((volatile __near __bitf_T *)0xFFE4)->no7)
#define CLMMK        (((volatile __near __bitf_T *)0xFFE5)->no0)
#define CSIMK00      (((volatile __near __bitf_T *)0xFFE5)->no1)
#define CSIMK01      (((volatile __near __bitf_T *)0xFFE5)->no2)
#define DMAMK0       (((volatile __near __bitf_T *)0xFFE5)->no3)
#define DMAMK1       (((volatile __near __bitf_T *)0xFFE5)->no4)
#define RTCMK        (((volatile __near __bitf_T *)0xFFE5)->no5)
#define ITMK         (((volatile __near __bitf_T *)0xFFE5)->no6)
#define LTMK0        (((volatile __near __bitf_T *)0xFFE5)->no7)
#define MK1          (*(volatile __near unsigned short *)0xFFE6)
#define MK1L         (*(volatile __near unsigned char  *)0xFFE6)
#define MK1L_bit     (*(volatile __near __bitf_T *)0xFFE6)
#define MK1H         (*(volatile __near unsigned char  *)0xFFE7)
#define MK1H_bit     (*(volatile __near __bitf_T *)0xFFE7)
#define LRMK0        (((volatile __near __bitf_T *)0xFFE6)->no0)
#define LSMK0        (((volatile __near __bitf_T *)0xFFE6)->no1)
#define PMKLR0       (((volatile __near __bitf_T *)0xFFE6)->no2)
#define SGMK         (((volatile __near __bitf_T *)0xFFE6)->no3)
#define TMMK00       (((volatile __near __bitf_T *)0xFFE6)->no4)
#define TMMK01       (((volatile __near __bitf_T *)0xFFE6)->no5)
#define TMMK02       (((volatile __near __bitf_T *)0xFFE6)->no6)
#define TMMK03       (((volatile __near __bitf_T *)0xFFE6)->no7)
#define ADMK         (((volatile __near __bitf_T *)0xFFE7)->no0)
#define LTMK1        (((volatile __near __bitf_T *)0xFFE7)->no1)
#define LRMK1        (((volatile __near __bitf_T *)0xFFE7)->no2)
#define LSMK1        (((volatile __near __bitf_T *)0xFFE7)->no3)
#define PMKLR1       (((volatile __near __bitf_T *)0xFFE7)->no4)
#define CSIMK10      (((volatile __near __bitf_T *)0xFFE7)->no5)
#define IICMK11      (((volatile __near __bitf_T *)0xFFE7)->no6)
#define TMMK04       (((volatile __near __bitf_T *)0xFFE7)->no7)
#define PR00         (*(volatile __near unsigned short *)0xFFE8)
#define PR00L        (*(volatile __near unsigned char  *)0xFFE8)
#define PR00L_bit    (*(volatile __near __bitf_T *)0xFFE8)
#define PR00H        (*(volatile __near unsigned char  *)0xFFE9)
#define PR00H_bit    (*(volatile __near __bitf_T *)0xFFE9)
#define WDTIPR0      (((volatile __near __bitf_T *)0xFFE8)->no0)
#define LVIPR0       (((volatile __near __bitf_T *)0xFFE8)->no1)
#define PPR00        (((volatile __near __bitf_T *)0xFFE8)->no2)
#define PPR01        (((volatile __near __bitf_T *)0xFFE8)->no3)
#define PPR02        (((volatile __near __bitf_T *)0xFFE8)->no4)
#define PPR03        (((volatile __near __bitf_T *)0xFFE8)->no5)
#define PPR04        (((volatile __near __bitf_T *)0xFFE8)->no6)
#define PPR05        (((volatile __near __bitf_T *)0xFFE8)->no7)
#define CLMPR0       (((volatile __near __bitf_T *)0xFFE9)->no0)
#define CSIPR000     (((volatile __near __bitf_T *)0xFFE9)->no1)
#define CSIPR001     (((volatile __near __bitf_T *)0xFFE9)->no2)
#define DMAPR00      (((volatile __near __bitf_T *)0xFFE9)->no3)
#define DMAPR01      (((volatile __near __bitf_T *)0xFFE9)->no4)
#define RTCPR0       (((volatile __near __bitf_T *)0xFFE9)->no5)
#define ITPR0        (((volatile __near __bitf_T *)0xFFE9)->no6)
#define LTPR00       (((volatile __near __bitf_T *)0xFFE9)->no7)
#define PR01         (*(volatile __near unsigned short *)0xFFEA)
#define PR01L        (*(volatile __near unsigned char  *)0xFFEA)
#define PR01L_bit    (*(volatile __near __bitf_T *)0xFFEA)
#define PR01H        (*(volatile __near unsigned char  *)0xFFEB)
#define PR01H_bit    (*(volatile __near __bitf_T *)0xFFEB)
#define LRPR00       (((volatile __near __bitf_T *)0xFFEA)->no0)
#define LSPR00       (((volatile __near __bitf_T *)0xFFEA)->no1)
#define PPR0LR0      (((volatile __near __bitf_T *)0xFFEA)->no2)
#define SGPR0        (((volatile __near __bitf_T *)0xFFEA)->no3)
#define TMPR000      (((volatile __near __bitf_T *)0xFFEA)->no4)
#define TMPR001      (((volatile __near __bitf_T *)0xFFEA)->no5)
#define TMPR002      (((volatile __near __bitf_T *)0xFFEA)->no6)
#define TMPR003      (((volatile __near __bitf_T *)0xFFEA)->no7)
#define ADPR0        (((volatile __near __bitf_T *)0xFFEB)->no0)
#define LTPR01       (((volatile __near __bitf_T *)0xFFEB)->no1)
#define LRPR01       (((volatile __near __bitf_T *)0xFFEB)->no2)
#define LSPR01       (((volatile __near __bitf_T *)0xFFEB)->no3)
#define PPR0LR1      (((volatile __near __bitf_T *)0xFFEB)->no4)
#define CSIPR010     (((volatile __near __bitf_T *)0xFFEB)->no5)
#define IICPR011     (((volatile __near __bitf_T *)0xFFEB)->no6)
#define TMPR004      (((volatile __near __bitf_T *)0xFFEB)->no7)
#define PR10         (*(volatile __near unsigned short *)0xFFEC)
#define PR10L        (*(volatile __near unsigned char  *)0xFFEC)
#define PR10L_bit    (*(volatile __near __bitf_T *)0xFFEC)
#define PR10H        (*(volatile __near unsigned char  *)0xFFED)
#define PR10H_bit    (*(volatile __near __bitf_T *)0xFFED)
#define WDTIPR1      (((volatile __near __bitf_T *)0xFFEC)->no0)
#define LVIPR1       (((volatile __near __bitf_T *)0xFFEC)->no1)
#define PPR10        (((volatile __near __bitf_T *)0xFFEC)->no2)
#define PPR11        (((volatile __near __bitf_T *)0xFFEC)->no3)
#define PPR12        (((volatile __near __bitf_T *)0xFFEC)->no4)
#define PPR13        (((volatile __near __bitf_T *)0xFFEC)->no5)
#define PPR14        (((volatile __near __bitf_T *)0xFFEC)->no6)
#define PPR15        (((volatile __near __bitf_T *)0xFFEC)->no7)
#define CLMPR1       (((volatile __near __bitf_T *)0xFFED)->no0)
#define CSIPR100     (((volatile __near __bitf_T *)0xFFED)->no1)
#define CSIPR101     (((volatile __near __bitf_T *)0xFFED)->no2)
#define DMAPR10      (((volatile __near __bitf_T *)0xFFED)->no3)
#define DMAPR11      (((volatile __near __bitf_T *)0xFFED)->no4)
#define RTCPR1       (((volatile __near __bitf_T *)0xFFED)->no5)
#define ITPR1        (((volatile __near __bitf_T *)0xFFED)->no6)
#define LTPR10       (((volatile __near __bitf_T *)0xFFED)->no7)
#define PR11         (*(volatile __near unsigned short *)0xFFEE)
#define PR11L        (*(volatile __near unsigned char  *)0xFFEE)
#define PR11L_bit    (*(volatile __near __bitf_T *)0xFFEE)
#define PR11H        (*(volatile __near unsigned char  *)0xFFEF)
#define PR11H_bit    (*(volatile __near __bitf_T *)0xFFEF)
#define LRPR10       (((volatile __near __bitf_T *)0xFFEE)->no0)
#define LSPR10       (((volatile __near __bitf_T *)0xFFEE)->no1)
#define PPR1LR0      (((volatile __near __bitf_T *)0xFFEE)->no2)
#define SGPR1        (((volatile __near __bitf_T *)0xFFEE)->no3)
#define TMPR100      (((volatile __near __bitf_T *)0xFFEE)->no4)
#define TMPR101      (((volatile __near __bitf_T *)0xFFEE)->no5)
#define TMPR102      (((volatile __near __bitf_T *)0xFFEE)->no6)
#define TMPR103      (((volatile __near __bitf_T *)0xFFEE)->no7)
#define ADPR1        (((volatile __near __bitf_T *)0xFFEF)->no0)
#define LTPR11       (((volatile __near __bitf_T *)0xFFEF)->no1)
#define LRPR11       (((volatile __near __bitf_T *)0xFFEF)->no2)
#define LSPR11       (((volatile __near __bitf_T *)0xFFEF)->no3)
#define PPR1LR1      (((volatile __near __bitf_T *)0xFFEF)->no4)
#define CSIPR110     (((volatile __near __bitf_T *)0xFFEF)->no5)
#define IICPR111     (((volatile __near __bitf_T *)0xFFEF)->no6)
#define TMPR104      (((volatile __near __bitf_T *)0xFFEF)->no7)
#define MDAL         (*(volatile __near unsigned short *)0xFFF0)
#define MULA         (*(volatile __near unsigned short *)0xFFF0)
#define MDAH         (*(volatile __near unsigned short *)0xFFF2)
#define MULB         (*(volatile __near unsigned short *)0xFFF2)
#define MDBH         (*(volatile __near unsigned short *)0xFFF4)
#define MULOH        (*(volatile __near unsigned short *)0xFFF4)
#define MDBL         (*(volatile __near unsigned short *)0xFFF6)
#define MULOL        (*(volatile __near unsigned short *)0xFFF6)
#define PMC          (*(volatile __near unsigned char  *)0xFFFE)
#define PMC_bit      (*(volatile __near __bitf_T *)0xFFFE)
#define MAA          (((volatile __near __bitf_T *)0xFFFE)->no0)


#define INTWDTI                         0x0004
#define INTLVI                          0x0006
#define INTP0                           0x0008
#define INTP1                           0x000A
#define INTP2                           0x000C
#define INTP3                           0x000E
#define INTP4                           0x0010
#define INTP5                           0x0012
#define INTCLM                          0x0014
#define INTCSI00                        0x0016
#define INTCSI01                        0x0018
#define INTDMA0                         0x001A
#define INTDMA1                         0x001C
#define INTRTC                          0x001E
#define INTIT                           0x0020
#define INTLT0                          0x0022
#define INTLR0                          0x0024
#define INTLS0                          0x0026
#define INTPLR0                         0x0028
#define INTSG                           0x002A
#define INTTM00                         0x002C
#define INTTM01                         0x002E
#define INTTM02                         0x0030
#define INTTM03                         0x0032
#define INTAD                           0x0034
#define INTLT1                          0x0036
#define INTLR1                          0x0038
#define INTLS1                          0x003A
#define INTPLR1                         0x003C
#define INTCSI10                        0x003E
#define INTIIC11                        0x0040
#define INTTM04                         0x0042
#define INTTM05                         0x0044
#define INTTM06                         0x0046
#define INTTM07                         0x0048
#define INTC1ERR                        0x004A
#define INTC1WUP                        0x004C
#define INTC0ERR                        0x004E
#define INTC0WUP                        0x0050
#define INTC0REC                        0x0052
#define INTC0TRX                        0x0054
#define INTTM10                         0x0056
#define INTTM11                         0x0058
#define INTTM12                         0x005A
#define INTTM13                         0x005C
#define INTMD                           0x005E
#define INTC1REC                        0x0060
#define INTFL                           0x0062
#define INTC1TRX                        0x0064
#define INTTM14                         0x0066
#define INTTM15                         0x0068
#define INTTM16                         0x006A
#define INTTM17                         0x006C
#define INTTM20                         0x006E
#define INTTM21                         0x0070
#define INTTM22                         0x0072
#define INTTM23                         0x0074
#define INTTM24                         0x0076
#define INTTM26                         0x0078
#define INTDMA2                         0x007A
#define INTDMA3                         0x007C

#endif
